{"assignees": [{"assignee_organization": "RingCentral, Inc.", "assignee_id": "cea894eb-7d79-4f1c-9972-660533346ccd", "assignee_lastknown_city": "Belmont", "assignee_total_num_inventors": "93", "assignee_total_num_patents": "209", "patents": [{"patent_number": "10015246", "patent_date": "2018-07-03", "patent_num_combined_citations": "29", "patent_kind": "B2", "patent_title": "Systems and methods for initiating a peer-to-peer communication session", "patent_abstract": "Systems and methods are disclosed for initiating a peer-to-peer communication session. According to certain embodiments, at least one peer device is identified. A first request is sent to the at least one peer device for an inventory of service capabilities of the at least one peer device. The requested inventory of service capabilities of the at least one peer device is received from the at least one peer device. A second request is sent to the at least one peer device to initiate a communication session with the at least one peer device using at least one service from the requested inventory of service capabilities.", "patent_id": "10015246"}, {"patent_number": "10015323", "patent_date": "2018-07-03", "patent_num_combined_citations": "14", "patent_kind": "B2", "patent_title": "System and method for provisioning temporary telephone numbers", "patent_abstract": "Systems, methods, and computer program products for provisioning a temporary disposable number are described. A user can be provided with a pool of available temporary disposable numbers that have a limited shelf life. The user can select one of the available temporary disposable numbers while submitting a permanent phone number associated with a communications device (e.g., mobile phone, home phone, business phone, etc.). Prior to activating the selected temporary disposable number, the temporary disposable number is linked to the permanent phone number. After activation, when an incoming call to the temporary disposable number is received, the permanent phone number is identified to be associated with the temporary disposable number being called. The incoming call is then forwarded to the communications device on which the permanent phone number is established.", "patent_id": "10015323"}, {"patent_number": "10021190", "patent_date": "2018-07-10", "patent_num_combined_citations": "12", "patent_kind": "B1", "patent_title": "Communication management method and system for inserting a bookmark in a chat session", "patent_abstract": "Communication management methods and systems may insert a bookmark in a chat session. In one implementation, a communication management server is provided. The communication management server comprises a memory storing a set of instructions, and at least one processor configured to: receive, from a plurality of user devices, communication messages associated with a group communication session; store the communication messages in a communication content database; provide the communication messages for display on a display of a user device; receive a display suspension instruction; and generate a visit bookmark indicating a last displayed message in the communication messages.", "patent_id": "10021190"}, {"patent_number": "10044597", "patent_date": "2018-08-07", "patent_num_combined_citations": "15", "patent_kind": "B2", "patent_title": "System and method for processing service requests using logical environments", "patent_abstract": "Systems and methods for processing service requests using logical environments. One of the methods includes receiving, by a router in a communication service provider system, a user service request from a first communication device; determining, by the router, an identifier of a first user of the communication service provider system associated with the first incoming service request; determining, by the router, a logical environment for the first user, wherein the logical environment for the first user identifies a plurality of components of the communication service provider system used to process service requests associated with the first user; identifying, by the router, a first application cluster of a first version of an application identified in the logical environment for the first user; and routing, by the router, the first incoming service request for processing by the first application cluster of the first version of the application.", "patent_id": "10044597"}, {"patent_number": "10051106", "patent_date": "2018-08-14", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "System and method for managing calls", "patent_abstract": "A computer-implemented method for managing calls in a collaboration environment is provided. The method includes receiving, by a processor, a call into a collaboration session of the collaboration environment. The method also includes identifying, by the processor, a user from a plurality of users associated with the collaboration session, based on at least one of contextual information regarding the call and information regarding the plurality of users. The method further includes providing, by the processor, an interface on a device associated with the identified user, wherein the interface enables the identified user to instruct the device to handle the call within the collaboration session.", "patent_id": "10051106"}, {"patent_number": "10057257", "patent_date": "2018-08-21", "patent_num_combined_citations": "15", "patent_kind": "B1", "patent_title": "Systems and methods for authenticating a user for access to a conference session by validating the user's location", "patent_abstract": "Systems and methods are provided for authenticating a user for access to a conference session by validating the user's location. The systems and methods may include receiving an image captured with an image-capturing device. The image may be of an object visible to a user from an authorized conference-session location. The image may be associated with the authorized conference-session location. The systems and methods may further include receiving location information indicating the authorized conference-session location, generating challenge questions based on the image, and designating one or more challenge questions for display to the user. The systems and methods may further include receiving a response to the designated challenge questions, validating the user's location based on the response, authenticating the user for access to a conference session based on the response, and granting the user access to the conference session based on the authentication.", "patent_id": "10057257"}, {"patent_number": "10084902", "patent_date": "2018-09-25", "patent_num_combined_citations": "26", "patent_kind": "B2", "patent_title": "Devices, methods, and graphical user interfaces for transferring calls", "patent_abstract": "Telephonic computing devices having touch screen displays with new and improved methods and user interfaces for performing actions related to selected messages in a message in-box and for transferring calls, thereby increasing the effectiveness, efficiency, and user satisfaction with such devices. Such methods, devices, and interfaces may complement or replace existing methods, devices, and interfaces for performing actions related to selected messages in a message in-box and for transferring calls.", "patent_id": "10084902"}, {"patent_number": "10085125", "patent_date": "2018-09-25", "patent_num_combined_citations": "14", "patent_kind": "B2", "patent_title": "Message management methods and systems", "patent_abstract": "A communications device is disclosed. The communications device comprises a memory configured to store instructions and a processor configured to execute the instructions to receive data representing a message provided by a caller, determine at least an attribute of the message based on the received data, generate one or more options based on the attribute of the message, and present the one or more options to the caller to prompt the caller to take an additional action related to the message.", "patent_id": "10085125"}, {"patent_number": "10129304", "patent_date": "2018-11-13", "patent_num_combined_citations": "26", "patent_kind": "B2", "patent_title": "Systems and methods for making common services available across network endpoints", "patent_abstract": "Systems and methods are disclosed for providing access to common services in a communication session. According to certain embodiments, a request to initiate a communication session is received. The communication can include a plurality of endpoints. An inventory of available services can be determined for each of the plurality of endpoints. At least one service that is commonly available to at least a subset of endpoints can be identified from the inventories of available services. Access can be provided to the at least one common service to the subset of endpoints during the communication session.", "patent_id": "10129304"}, {"patent_number": "10154135", "patent_date": "2018-12-11", "patent_num_combined_citations": "36", "patent_kind": "B2", "patent_title": "System and method for determining availability statuses for users", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for determining availability statuses for users of a communication service provider system. One of the methods includes obtaining data identifying a plurality of availability status features for a user of a communication service provider system and a respective weight for each of the availability status features; determining a respective current value of each of the availability status features; and determining an aggregate user availability status based at least in part on the current values of the availability status features and on the weights for the availability status features.", "patent_id": "10154135"}, {"patent_number": "10164924", "patent_date": "2018-12-25", "patent_num_combined_citations": "22", "patent_kind": "B2", "patent_title": "Systems, devices and methods for initiating communications based on selected content", "patent_abstract": "A communications device comprising at least one processing device configured to receive an input selection for use in connection with a communications session, including content of a portion of a chat associated with at least one first user and contact information associated with a second user, wherein the second user is different from the at least one first user. The at least one processing device is further configured to identify at least one object in the selected content to determine information describing the chat portion, and to initiate a communications session with at least one terminal device associated with the second user based on the contact information. The at least one processing device is also configured to transmit a message, including the determined information, to the at least one terminal device associated with the second user.", "patent_id": "10164924"}, {"patent_number": "10200417", "patent_date": "2019-02-05", "patent_num_combined_citations": "4", "patent_kind": "B2", "patent_title": "Systems and methods for conferencing", "patent_abstract": "Systems and methods are provided for establishing a video conference session. The systems and methods may include receiving, from a first conference client device, a request to establish a conference session with a second conference client device; determining a first media router for forwarding, to the second conference client device, a media data stream with predetermined attributes of a plurality of first media data streams generated by the first conference client device; determining a second media router for forwarding, to the first conference client, a media data stream with predetermined media attributes of a plurality of second media data streams generated by the second conference client device; and transmitting, to the first conference client device, a first address associated with the first media router and a second address associated with the second media router.", "patent_id": "10200417"}, {"patent_number": "10205974", "patent_date": "2019-02-12", "patent_num_combined_citations": "19", "patent_kind": "B1", "patent_title": "Systems and methods for providing shared memory pointers to a persistent video stream for use in a video communications session", "patent_abstract": "The present disclosure relates to systems and methods for providing a video stream to one or more communication sessions. In one implementation, the system may include a video recording device, a memory storing instructions, and a processor configured to execute the instructions. The instructions may comprise instructions to activate the video recording device and receive a video stream therefrom, buffer the video stream in an allocated portion of the memory, allow access to the buffered video stream for use in a first communications session, continue buffering the video stream after the buffered video stream has been accessed for use in the first communications session, and allow access to the buffered video stream for use in a second communications session.", "patent_id": "10205974"}, {"patent_number": "10212204", "patent_date": "2019-02-19", "patent_num_combined_citations": "18", "patent_kind": "B2", "patent_title": "Systems and methods for improving media data communications over a network", "patent_abstract": "Systems and methods are disclosed for improving transmission of media data contained in data packets in a media session established over a network. According to certain embodiments, a first server can determine that at least one media quality metric associated with the media session is below one or more pre-determined thresholds, the at least one media quality metric being indicative of a media quality. The first server can also obtain identification information associated with the media session, provide the identification information to a second server, receive, from the second server data, related to a transmission of data packets, and media data contained in the data packets. The first server can determine configurations based on the received data related to a transmission of data packets. At least one of the first and second servers can be configured based on the determined configurations to provide a pre-determined media quality.", "patent_id": "10212204"}, {"patent_number": "10217029", "patent_date": "2019-02-26", "patent_num_combined_citations": "16", "patent_kind": "B1", "patent_title": "Systems and methods for automatically generating headshots from a plurality of still images", "patent_abstract": "The present disclosure relates to systems and methods for generating headshots from a plurality of still images. In one implementation, the system may include a memory storing instructions and a processor configured to execute the instructions. The instructions may include instructions to receive a plurality of still images from one or more video feeds, score the plurality of images along a plurality of dimensions based on a scale, rank the plurality of images using at least one of a composite score or at least one of the dimensions, select a subset of the plurality of images using the ranking, and construct at least one headshot of the user from the subset of the plurality of images.", "patent_id": "10217029"}, {"patent_number": "10223443", "patent_date": "2019-03-05", "patent_num_combined_citations": "18", "patent_kind": "B2", "patent_title": "System, device, and method for administration of an electronic communications device in a communications network", "patent_abstract": "A computer readable medium configured for use in a mobile device for assigning an electronic communications device to a selected member of an organization. The computer readable medium containing instructions that when executed by at least one processor cause the mobile device to capture an identifier associated with an electronic communications device connectable to a communications network associated with an organization. The instructions also cause the mobile device to access a database including information about a plurality of electronic communications devices that are part of the organization's communications network. The instructions further cause the mobile device to present on a display usage information about the electronic communications device for association of the electronic communications device to a selected member of the organization. Then, the instructions may cause the mobile device to determine at least one value to reflect that the electronic communications device is assigned to the selected member.", "patent_id": "10223443"}, {"patent_number": "10225334", "patent_date": "2019-03-05", "patent_num_combined_citations": "4", "patent_kind": "B2", "patent_title": "System and method for estimating distributed consumption of a quota", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for estimating distributed consumption of a quota. One of the methods includes receiving, by a first request processing server, a request having one or more specified characteristics; identifying a quota; determining, by the first request processing server, an actual number of requests having the one or more characteristics received by the first request processing server since a most recent synchronization with a parent server; generating, by the first request processing server, a current estimated total number of requests having the one or more characteristics that have been received; determining, by the first request processing server, that the quota has not been reached; and approving, by the first request processing server, the received request.", "patent_id": "10225334"}, {"patent_number": "10225393", "patent_date": "2019-03-05", "patent_num_combined_citations": "12", "patent_kind": "B2", "patent_title": "System and method for managing calls", "patent_abstract": "A computer-implemented method for managing calls in a collaboration environment is provided. The method includes receiving, by a processor, a call into a collaboration session of the collaboration environment. The method also includes identifying, by the processor, a user from a plurality of users associated with the collaboration session, based on at least one of contextual information regarding the call and information regarding the plurality of users. The method further includes providing, by the processor, an interface on a device associated with the identified user, wherein the interface enables the identified user to instruct the device to handle the call within the collaboration session.", "patent_id": "10225393"}, {"patent_number": "10250742", "patent_date": "2019-04-02", "patent_num_combined_citations": "8", "patent_kind": "B2", "patent_title": "Systems and methods for generating application data from call data", "patent_abstract": "Systems and methods are provided for generating application data from call data. In one implementation, a method includes acquiring call data from a call-data source with a call-data aggregator; modifying a portion of the call data with a call-data modifier; and generating application data from the portion of the call data. Application data may be configured for diagram generation. The diagram may graphically indicate call volume in branches of an interactive voice response (IVR) system map. The diagram may be a flow diagram including a connector associated with a branch of the IVR system map and the connector may have a width proportional to a call volume in the branch of the IVR system map. The diagram may indicate call-portion durations, which may be associated with a phase of a call and which may have a color associated with a phase of a call.", "patent_id": "10250742"}, {"patent_number": "10291547", "patent_date": "2019-05-14", "patent_num_combined_citations": "5", "patent_kind": "B2", "patent_title": "Systems and methods for determining routing information for a network request", "patent_abstract": "Systems and methods are disclosed for processing a request for network resources in a network comprising at least one endpoint a first pool of destinations. According to certain embodiments, a first request is received from an endpoint. A determination of whether to validate a first destination identifier associated with the first request is made based on at least one of a first timestamp and a first pool identifier associated with the first request. If it is determined to validate the first destination identifier, a target destination identifier is determined, and the first request is forwarded based on the target destination identifier. The requested network resource is received, and is transmitted to the endpoint.", "patent_id": "10291547"}, {"patent_number": "10298482", "patent_date": "2019-05-21", "patent_num_combined_citations": "13", "patent_kind": "B2", "patent_title": "Systems and methods for regulating network resources to improve data-transmission quality", "patent_abstract": "Systems and methods are provided for regulating network resources to improve data-transmission quality. In one implementation, a method includes searching one or more computer-readable memory locations for prior-session data that matches current-session data. The prior-session data may comprise information describing a prior data-transmission session and the current-session data may comprise information describing a current data-transmission session. Data describing a cause of transmission degradation may be stored in association with the prior data-transmission session. The method may also include identifying, by at least one processor, the cause of transmission degradation in the prior data-transmission session as being a cause of transmission degradation in the current data-transmission session if the prior-session data matches the current-session data. The method may also include initiating correction of the cause of transmission degradation based on the identification.", "patent_id": "10298482"}, {"patent_number": "10306184", "patent_date": "2019-05-28", "patent_num_combined_citations": "2", "patent_kind": "B1", "patent_title": "Masking video feedback loop during screen sharing", "patent_abstract": "A method includes capturing a first image associated with a portion of a display screen being shared. The method further includes rendering the first image in a preview window of the display screen being shared to form a second image. The second image is captured so as to determine whether the first image is duplicated in the second image. The duplication of the first image in the second image is masked to form a third image. The third image is rendered in the preview window.", "patent_id": "10306184"}, {"patent_number": "10326879", "patent_date": "2019-06-18", "patent_num_combined_citations": "11", "patent_kind": "B1", "patent_title": "System and method for evaluating the quality of a communication session", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for evaluating the quality of a communication session. One of the methods includes identifying, by a communication system, a communication session between one or more users of the communication system, wherein, during the communication session, session data is routed between a first communications device of a first user of the communication system and one or more other communications devices along a communication path; obtaining, from each of a plurality of communication nodes along the communication path, quality data relating to a quality of the communication session at the communication node; generating, using the quality data, a model input to a quality score machine learning model; and providing the model input as input to the quality score machine learning model to generate the estimated quality score for at least the portion of the communication session.", "patent_id": "10326879"}, {"patent_number": "10362269", "patent_date": "2019-07-23", "patent_num_combined_citations": "11", "patent_kind": "B2", "patent_title": "Systems and methods for determining one or more active speakers during an audio or video conference session", "patent_abstract": "The present disclosure relates to systems and methods for automatically determining the active users in an audio or video conference session including a plurality of users. In one implementation, the system may include a memory storing instructions and a processor configured to execute the instructions to receive packets from a device associated with each of a plurality of users, update a loudest level associated with each user if the received packet from the user reflects a communication louder than all of the previously received packets from the user, calculate a loudness ratio associated with each user based on the loudest level associated with each user and a corresponding time-decaying average, sort the plurality of users by a loudness score associated with each user, and mute audio or hide video received from a subset of the plurality of users in the conference session. The loudness score may be based on the loudness ratio associated with each user, and the muted or hidden subset may include one or more users for which the associated loudness score is lowest according to the sorting.", "patent_id": "10362269"}, {"patent_number": "10367870", "patent_date": "2019-07-30", "patent_num_combined_citations": "20", "patent_kind": "B2", "patent_title": "Conferencing system and method implementing video quasi-muting", "patent_abstract": "A first communication is provided for use in a video conference session with a second communication portal via a network. The first communication portal may be configured to transmit live video stream of a participant through the second communication portal for presentation on a display thereof, and to a receive control instruction the participant to stop transmitting live video stream. The first communication portal may also be configured to selectively transmit a video clip showing the participant for playback on the display based on the received control instruction.", "patent_id": "10367870"}, {"patent_number": "10389886", "patent_date": "2019-08-20", "patent_num_combined_citations": "17", "patent_kind": "B2", "patent_title": "System and method for provisioning temporary telephone numbers", "patent_abstract": "Systems, methods, and computer program products for provisioning a temporary disposable number are described. A user can be provided with a pool of available temporary disposable numbers that have a limited shelf life. The user can select one of the available temporary disposable numbers while submitting a permanent phone number associated with a communications device (e.g., mobile phone, home phone, business phone, etc.). Prior to activating the selected temporary disposable number, the temporary disposable number is linked to the permanent phone number. After activation, when an incoming call to the temporary disposable number is received, the permanent phone number is identified to be associated with the temporary disposable number being called. The incoming call is then forwarded to the communications device on which the permanent phone number is established.", "patent_id": "10389886"}, {"patent_number": "10397403", "patent_date": "2019-08-27", "patent_num_combined_citations": "6", "patent_kind": "B2", "patent_title": "System and method for managing events at contact center", "patent_abstract": "A system for managing events at a contact center is disclosed. The system may include a memory and at least one processor. The at least one processor may be configured to receive an input from a user identifying at least one condition associated with a service level at the contact center, the at least one condition including at least a threshold of a call waiting time at the contact center; detect an occurrence of an event meeting one of the at least one condition; and in response to the detecting, provide a notification to a device associated with the user and operating in a collaboration environment, thereby notifying the occurrence of the event.", "patent_id": "10397403"}, {"patent_number": "10419719", "patent_date": "2019-09-17", "patent_num_combined_citations": "20", "patent_kind": "B2", "patent_title": "Method and system for enhanced conference management", "patent_abstract": "The present disclosure provides methods and systems for enhanced conference management. According to some embodiments, a conference management server for enhanced conference management is provided. The conference management server comprises a memory storing a set of instructions, and at least one processor configured to execute the instructions to: receive, from a user device, conference information including a conference subject and an identification of at least one participant; determine, based on the received conference information, a degree of formality for a conference; and send a conference notification to one or more devices or participants identified based on the conference information, the conference notification including information reflecting the degree of formality for the conference.", "patent_id": "10419719"}, {"patent_number": "10432777", "patent_date": "2019-10-01", "patent_num_combined_citations": "13", "patent_kind": "B2", "patent_title": "System and method for managing calls", "patent_abstract": "A computer-implemented method for managing calls in a collaboration environment is provided. The method includes receiving, by a processor, a call into a collaboration session of the collaboration environment. The method also includes identifying, by the processor, a user from a plurality of users associated with the collaboration session, based on at least one of contextual information regarding the call and information regarding the plurality of users. The method further includes providing, by the processor, an interface on a device associated with the identified user, wherein the interface enables the identified user to instruct the device to handle the call within the collaboration session.", "patent_id": "10432777"}, {"patent_number": "10484314", "patent_date": "2019-11-19", "patent_num_combined_citations": "15", "patent_kind": "B2", "patent_title": "Method, device and system for providing input suggestion", "patent_abstract": "A computer-implemented method for providing an input suggestion for a user is disclosed. The computer-implemented method may include identifying an intended recipient of an electronic message input by the user; identifying a location associated with the user and a time associated with the electronic message input by the user; determining the input suggestion for the user based on an input profile of the intended recipient, the location, and the time; and outputting the input suggestion via a user device associated with the user.", "patent_id": "10484314"}, {"patent_number": "10491683", "patent_date": "2019-11-26", "patent_num_combined_citations": "18", "patent_kind": "B2", "patent_title": "Communication management method and system for inserting a bookmark in a chat session", "patent_abstract": "Communication management methods and systems may insert a bookmark in a chat session. In one implementation, a communication management server is provided. The communication management server comprises a memory storing a set of instructions, and at least one processor configured to: receive, from a plurality of user devices, communication messages associated with a group communication session; store the communication messages in a communication content database; provide the communication messages for display on a display of a user device; receive a display suspension instruction; and generate a visit bookmark indicating a last displayed message in the communication messages.", "patent_id": "10491683"}, {"patent_number": "10523617", "patent_date": "2019-12-31", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "Method and system for providing notification", "patent_abstract": "A system for providing a notification for a plurality of messages is disclosed. The system may include a memory and at least one processor. The at least one processor may be configured to receive the plurality of messages from one or more devices associated with one or more users; identify one or more subjects associated with the plurality of messages; and provide the notification including the plurality of messages to a device associated with a recipient, wherein the plurality of messages are arranged in the notification based on the identified one or more subjects, and wherein the one or more users and the recipient exchange the plurality of messages in a collaborative environment.", "patent_id": "10523617"}, {"patent_number": "10540981", "patent_date": "2020-01-21", "patent_num_combined_citations": "7", "patent_kind": "B2", "patent_title": "Systems and methods for speech signal processing to transcribe speech", "patent_abstract": "The present disclosure relates to systems and methods for speech signal processing on a signal to transcribe speech. In one implementation, the system may include a memory storing instructions and a processor configured to execute the instructions. The instructions may include instructions to receive the signal, determine if at least a portion of data in the signal is missing, and when at least a portion of data is missing: process the signal using a hidden Markov model to generate an output; using the output, calculate a set of possible contents to fill a gap due to the missing data portion, with each possible content having an associated probability; based on the associated probabilities, select one of the set of possible contents; and using the selected possible content, update the signal.", "patent_id": "10540981"}, {"patent_number": "10542156", "patent_date": "2020-01-21", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "System and method for provisioning temporary telephone numbers", "patent_abstract": "Systems, methods, and computer program products for provisioning a temporary disposable number are described. A user can be provided with a pool of available temporary disposable numbers that have a limited shelf life. The user can select one of the available temporary disposable numbers while submitting a permanent phone number associated with a communications device (e.g., mobile phone, home phone, business phone, etc.). Prior to activating the selected temporary disposable number, the temporary disposable number is linked to the permanent phone number. After activation, when an incoming call to the temporary disposable number is received, the permanent phone number is identified to be associated with the temporary disposable number being called. The incoming call is then forwarded to the communications device on which the permanent phone number is established.", "patent_id": "10542156"}, {"patent_number": "10587750", "patent_date": "2020-03-10", "patent_num_combined_citations": "59", "patent_kind": "B2", "patent_title": "Enhanced caller-ID information selection and delivery", "patent_abstract": "Technologies relating to enhanced Caller ID information selection for a caller associated with a call and delivery of the selected enhanced Caller ID information to a callee associated with the call include one or more processors selecting, according to selection criteria, one or more enhanced Caller ID information items from a collection of available enhanced Caller information items pertaining to the caller that are stored across one or more databases of enhanced Caller ID information.", "patent_id": "10587750"}, {"patent_number": "10630738", "patent_date": "2020-04-21", "patent_num_combined_citations": "17", "patent_kind": "B1", "patent_title": "Method and system for sharing annotated conferencing content among conference participants", "patent_abstract": "Shared conferencing content may be annotated during presentation either by a presenter or by a participant of a conference. The annotated content may be manipulated by a participant or by a presenter through a user interface. A system for annotating shared conferencing content may be configured to receive, in real time, an annotation for a portion of multimedia content. The annotated portions of the multimedia content may have a set of associated characteristics for manipulating the portions of the multimedia content. A multimedia conferencing method may include permitting, in response to a received request, manipulation of the annotated portions of the multimedia content based on the set of the associated characteristics.", "patent_id": "10630738"}, {"patent_number": "10631021", "patent_date": "2020-04-21", "patent_num_combined_citations": "22", "patent_kind": "B2", "patent_title": "Systems and methods for enabling a persistent stream for use in a communications session", "patent_abstract": "The present disclosure relates to systems and methods for providing a video stream to one or more communication sessions. In one implementation, the system may include a video recording device, a memory storing instructions, and a processor configured to execute the instructions. The instructions may comprise instructions to activate the video recording device and receive a video stream therefrom, buffer the video stream in an allocated portion of the memory, allow access to the buffered video stream for use in a first communications session, continue buffering the video stream after the buffered video stream has been accessed for use in the first communications session, and allow access to the buffered video stream for use in a second communications session.", "patent_id": "10631021"}, {"patent_number": "10637922", "patent_date": "2020-04-28", "patent_num_combined_citations": "37", "patent_kind": "B2", "patent_title": "Systems and methods for initiating a peer-to-peer communication session", "patent_abstract": "Systems and methods are disclosed for initiating a peer-to-peer communication session. According to certain embodiments, at least one peer device is identified. A first request is sent to the at least one peer device for an inventory of service capabilities of the at least one peer device. The requested inventory of service capabilities of the at least one peer device is received from the at least one peer device. A second request is sent to the at least one peer device to initiate a communication session with the at least one peer device using at least one service from the requested inventory of service capabilities.", "patent_id": "10637922"}, {"patent_number": "10645154", "patent_date": "2020-05-05", "patent_num_combined_citations": "5", "patent_kind": "B2", "patent_title": "System and method for estimating distributed consumption of a quota", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for estimating distributed consumption of a quota. One of the methods includes receiving, by a first request processing server, a request having one or more specified characteristics; identifying a quota; determining, by the first request processing server, an actual number of requests having the one or more characteristics received by the first request processing server since a most recent synchronization with a parent server; generating, by the first request processing server, a current estimated total number of requests having the one or more characteristics that have been received; determining, by the first request processing server, that the quota has not been reached; and approving, by the first request processing server, the received request.", "patent_id": "10645154"}, {"patent_number": "10659591", "patent_date": "2020-05-19", "patent_num_combined_citations": "14", "patent_kind": "B2", "patent_title": "System and method for managing calls", "patent_abstract": "A computer-implemented method for managing calls in a collaboration environment is provided. The method includes receiving, by a processor, a call into a collaboration session of the collaboration environment. The method also includes identifying, by the processor, a user from a plurality of users associated with the collaboration session, based on at least one of contextual information regarding the call and information regarding the plurality of users. The method further includes providing, by the processor, an interface on a device associated with the identified user, wherein the interface enables the identified user to instruct the device to handle the call within the collaboration session.", "patent_id": "10659591"}, {"patent_number": "10666791", "patent_date": "2020-05-26", "patent_num_combined_citations": "20", "patent_kind": "B2", "patent_title": "System and method for evaluating the quality of a communication session", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for evaluating the quality of a communication session. One of the methods includes identifying, by a communication system, a communication session between one or more users of the communication system, wherein, during the communication session, session data is routed between a first communications device of a first user of the communication system and one or more other communications devices along a communication path; obtaining, from each of a plurality of communication nodes along the communication path, quality data relating to a quality of the communication session at the communication node; generating, using the quality data, a model input to a quality score machine learning model; and providing the model input as input to the quality score machine learning model to generate the estimated quality score for at least the portion of the communication session.", "patent_id": "10666791"}, {"patent_number": "10694028", "patent_date": "2020-06-23", "patent_num_combined_citations": "12", "patent_kind": "B2", "patent_title": "Systems and methods for generating application data from call data", "patent_abstract": "Systems and methods are provided for generating application data from call data. In one implementation, a method includes acquiring call data from a call-data source with a call-data aggregator; modifying a portion of the call data with a call-data modifier; and generating application data from the portion of the call data. Application data may be configured for diagram generation. The diagram may graphically indicate call volume in branches of an interactive voice response (IVR) system map. The diagram may be a flow diagram including a connector associated with a branch of the IVR system map and the connector may have a width proportional to a call volume in the branch of the IVR system map. The diagram may indicate call-portion durations, which may be associated with a phase of a call and which may have a color associated with a phase of a call.", "patent_id": "10694028"}, {"patent_number": "10715765", "patent_date": "2020-07-14", "patent_num_combined_citations": "24", "patent_kind": "B2", "patent_title": "System and method for dynamically selecting networked cameras in a video conference", "patent_abstract": "Systems and methods are provided for dynamically selecting one or more networked cameras for providing real-time camera feeds to a video conference. The systems and methods may include identifying one or more networked cameras associated with an area of a conference participant. A server may analyze real-time camera feeds from the identified cameras, and select a video feed having a view of the participant. The server may provide the selected feed to the video conference via a conference bridge, and continue monitoring camera feeds of cameras associated with the participant's area for another camera feed having a better view of the participant. Networked cameras may include fixed and mobile cameras owned and operated by individuals that are not associated with the participant, but who have registered their cameras with the server for use in video conferences.", "patent_id": "10715765"}, {"patent_number": "10720175", "patent_date": "2020-07-21", "patent_num_combined_citations": "17", "patent_kind": "B2", "patent_title": "Conferencing system and method for controlling the conferencing system", "patent_abstract": "A communication system and a method can be configured to facilitate the performance of a conference. The system can include a conference organizer terminal and at least two participants' terminals each assigned to respective conference participants who each log in to start a conference on the communication system. The communication system can be configured to calculate a decision situation at a particular point in time of the ongoing conference by analyzing the views expressed by the conference participants during the conference and send data relating to the decision situation for that point in time to the conference organizer's terminal and/or other conference participant terminals for use in facilitating the conference. IN some embodiments, such data can be used to assist the conference participants' in recognizing when there is a consensus made on at least one decision to be made during the conference.", "patent_id": "10720175"}, {"patent_number": "10721200", "patent_date": "2020-07-21", "patent_num_combined_citations": "9", "patent_kind": "B2", "patent_title": "Method and device for managing communications activities", "patent_abstract": "A method is disclosed for managing communication processes (N1-N4) between internal participants (A, B, C) of an internal communication network on the one hand and external participants (E) on the other hand. First a list is set up in an internal communication network that contains incoming and outgoing communication activities between the internal participants and at least one external participant as a virtual mailbox. This virtual mailbox is assigned to the at least one external participant and is set up to be invisible or inaccessible to the at least one external participant. Communications activity between an internal participant and the external participant are recognized as being associated with the external participant based upon identification that has been assigned to the external participant and can be obtained from the communication activity. Each communication activity that has been recognized as being associated with the external participant is deposited in the virtual mailbox.", "patent_id": "10721200"}, {"patent_number": "10721203", "patent_date": "2020-07-21", "patent_num_combined_citations": "32", "patent_kind": "B2", "patent_title": "Method, device and software product for filling an address field of an electronic message", "patent_abstract": "A content, context or the like as entered by a user may be used to automatically evaluate a recipient or recipients to whom the message is directed. A method for filling a recipient address field of an electronic message in a messaging application executable on a communication terminal begins by selecting a content chunk from a content area of said message and deciding whether said content chunk matches a predefined addressee identifier pattern. If the content chunk matches a predefined addressee identifier pattern then the a name portion is extracted from the content chunk. The name portion is compared with entries in a predefined directory. It the name portion matches an entry then a recipient address proposal is created based on an address stored in the directory. That recipient address proposal is filled into said recipient address field of said message.", "patent_id": "10721203"}, {"patent_number": "10726305", "patent_date": "2020-07-28", "patent_num_combined_citations": "39", "patent_kind": "B2", "patent_title": "Systems and methods for automatically generating headshots from a plurality of still images", "patent_abstract": "The present disclosure relates to systems and methods for generating headshots from a plurality of still images. In one implementation, the system may include a memory storing instructions and a processor configured to execute the instructions. The instructions may include instructions to receive a plurality of still images from one or more video feeds, score the plurality of images along a plurality of dimensions based on a scale, rank the plurality of images using at least one of a composite score or at least one of the dimensions, select a subset of the plurality of images using the ranking, and construct at least one headshot of the user from the subset of the plurality of images.", "patent_id": "10726305"}, {"patent_number": "10735410", "patent_date": "2020-08-04", "patent_num_combined_citations": "18", "patent_kind": "B2", "patent_title": "Systems and methods for authenticating a user for access to a conference session by validating the user's location", "patent_abstract": "Systems and methods are provided for authenticating a user for access to a conference session by validating the user's location. The systems and methods may include receiving an image captured with an image-capturing device. The image may be of an object visible to a user from an authorized conference-session location. The image may be associated with the authorized conference-session location. The systems and methods may further include receiving location information indicating the authorized conference-session location, generating challenge questions based on the image, and designating one or more challenge questions for display to the user. The systems and methods may further include receiving a response to the designated challenge questions, validating the user's location based on the response, authenticating the user for access to a conference session based on the response, and granting the user access to the conference session based on the authentication.", "patent_id": "10735410"}, {"patent_number": "10735483", "patent_date": "2020-08-04", "patent_num_combined_citations": "43", "patent_kind": "B2", "patent_title": "Method for transmitting data in a multimedia system, and software product and device for controlling the transmission of data in a multimedia system", "patent_abstract": "Method and software product for transferring data, plus equipment for controlling data transfer in a multimedia system that includes a group of participants' terminals, with which multimedia data generated by participants' terminals contained in the group are sent to one or more participants' terminals contained in the group and played back there. A central synchronization unit generates synchronization labels containing time information and sends them to the participants' terminals contained in the group, and the synchronization labels are used to play back information in modified time.", "patent_id": "10735483"}, {"patent_number": "10740680", "patent_date": "2020-08-11", "patent_num_combined_citations": "8", "patent_kind": "B2", "patent_title": "System and method for message reaction analysis", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for detecting and analyzing user reactions to messages received. One of the methods includes obtaining reaction data characterizing a reaction of a first user to a communication sent by a second user using a first communication service, wherein the first communication service allows users to react to received communications by selecting from a predetermined set of proprietary reactions that are supported by the first communication service; analyzing the reaction data to generate standardized reaction data that characterizes a sentiment of the reaction of the first user to the communication; mapping the standardized reaction data to one or more proprietary reactions from the predetermined set of proprietary reactions that are supported by the first communication service; and providing, to the first communication service, data identifying the one or more proprietary reactions.", "patent_id": "10740680"}, {"patent_number": "10749833", "patent_date": "2020-08-18", "patent_num_combined_citations": "34", "patent_kind": "B2", "patent_title": "Messaging system having send-recommendation functionality", "patent_abstract": "A method is provided for determining when to send an electronic message. The method may include receiving the electronic message for a recipient, and making a prediction associated with the electronic message being positively received by the recipient based on an attribute of the electronic message and an additional attribute of the recipient. The method may also include selectively sending or deferring sending of the electronic message based on the prediction.", "patent_id": "10749833"}, {"patent_number": "10749922", "patent_date": "2020-08-18", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "Method and telecommunications arrangement for transferring media data having differing media types via a network sensitive to quality of service", "patent_abstract": "A telecommunication system and a method for transferring media data from a first client over a QoS-sensitive network to a second client. The system and method can permit media data, which contain a first media type with a first traffic class and a second media type with a second traffic class to be bundled by the first client into second packets. In each second packet, the traffic class for each media type is marked in layer 4 and/or layer 5. The second packets can be transmitted toward the second client. Either before or during the transfer to the network, the second packets can be unbundled using the markings in layer 4 and/or layer 5 and then bundled into first packets, each of which has only one of the traffic classes. At least some of the first packets can then be transmitted over the network to the second client.", "patent_id": "10749922"}, {"patent_number": "10757056", "patent_date": "2020-08-25", "patent_num_combined_citations": "58", "patent_kind": "B2", "patent_title": "System and method for determining presence based on an attribute of an electronic message", "patent_abstract": "Systems and methods are provided for determining a presence of an electronic message recipient based on an attribute of the electronic message, such as the content and/or context of the electronic message. The systems and methods can include acquiring, at a server, an electronic message from a sender, and determining an attribute of the electronic message. Based on the determined attribute, the server assigns an urgency level to the electronic message, which corresponds to a response time period. The server then monitors the recipient's device for a response to the electronic message, and to collect monitoring data about activity performed by the recipient on the device, or the environment surrounding the device. If the recipient does not respond within the response time period the server informs the sender a presence status of the recipient based on the monitoring data.", "patent_id": "10757056"}, {"patent_number": "10785450", "patent_date": "2020-09-22", "patent_num_combined_citations": "7", "patent_kind": "B1", "patent_title": "System and method for intelligent conference session recording", "patent_abstract": "A computer-implemented method for intelligent conference recording is disclosed. The computer-implemented method for intelligent conference recording may analyze content and context information related to a conference session, determine if at least one recording threshold criteria is met, and based on the determined recording threshold criteria, start a recording of the conference session. The computer-implemented method for intelligent conference recording can share the conference session recording based on a voting result.", "patent_id": "10785450"}, {"patent_number": "10785480", "patent_date": "2020-09-22", "patent_num_combined_citations": "15", "patent_kind": "B2", "patent_title": "Method for encoding of a video stream", "patent_abstract": "A temporal sequence of pictures is generated in a method for encoding of a first video stream. To do so, a synchronization signal can be used, which can be derived from a second video stream independently of the first video stream. Alternatively, the encoding of a second video stream independent of the first video stream can be based on the same principle as for the encoding of the first video stream.", "patent_id": "10785480"}, {"patent_number": "10798248", "patent_date": "2020-10-06", "patent_num_combined_citations": "21", "patent_kind": "B2", "patent_title": "System and method for provisioning temporary telephone numbers", "patent_abstract": "Systems, methods, and computer program products for provisioning a temporary disposable number are described. A user can be provided with a pool of available temporary disposable numbers that have a limited shelf life. The user can select one of the available temporary disposable numbers while submitting a permanent phone number associated with a communications device (e.g., mobile phone, home phone, business phone, etc.). Prior to activating the selected temporary disposable number, the temporary disposable number is linked to the permanent phone number. After activation, when an incoming call to the temporary disposable number is received, the permanent phone number is identified to be associated with the temporary disposable number being called. The incoming call is then forwarded to the communications device on which the permanent phone number is established.", "patent_id": "10798248"}, {"patent_number": "10803880", "patent_date": "2020-10-13", "patent_num_combined_citations": "37", "patent_kind": "B2", "patent_title": "Method, device, and system for audio data processing", "patent_abstract": "A method and apparatus that filters audio data received from a speaking person that includes a specific filter for that speaker. The audio characteristics of the speaker's voice may be collected and the specific filter may be formed to reduce noise while also enhancing voice quality. For instance, if a speaker's voice does not contain specific frequencies, then a filter may cancel the noise at such frequencies to ease noise cancellation and reduce processing sound spectrum for cleaning that is not needed. Additionally, the strength frequencies of a speaker's voice may be identified from the collected audio characteristics and those spectrums can be filtered with finer granularity to provide a speaker specific filter that enhances the voice quality of the speaker's voice data that is transmitted or output by a communication device. The audio data may also be output based upon a user's predefined hearing spectrum.", "patent_id": "10803880"}, {"patent_number": "10805101", "patent_date": "2020-10-13", "patent_num_combined_citations": "7", "patent_kind": "B1", "patent_title": "Collaborative communications environment and automatic account creation thereof", "patent_abstract": "A method includes receiving a signal associated with an electronic meeting invitation for users to attend the electronic meeting. The users include members of an organization and at least one nonmember of the organization. Responsive to receiving the signal, an online collaborative team is automatically created within an online chat environment. The team members of the online collaborative team include the members and the at least one nonmember. In some embodiments, an online collaborative team account is automatically created for the at least one nonmember responsive to determining that the at least one nonmember has no online collaborative team account.", "patent_id": "10805101"}, {"patent_number": "10805359", "patent_date": "2020-10-13", "patent_num_combined_citations": "6", "patent_kind": "B2", "patent_title": "Systems and methods for conferencing", "patent_abstract": "Systems and methods are provided for establishing a video conference session. The systems and methods may include receiving, from a first conference client device, a request to establish a conference session with a second conference client device; determining a first media router for forwarding, to the second conference client device, a media data stream with predetermined attributes of a plurality of first media data streams generated by the first conference client device; determining a second media router for forwarding, to the first conference client, a media data stream with predetermined media attributes of a plurality of second media data streams generated by the second conference client device; and transmitting, to the first conference client device, a first address associated with the first media router and a second address associated with the second media router.", "patent_id": "10805359"}, {"patent_number": "10812435", "patent_date": "2020-10-20", "patent_num_combined_citations": "98", "patent_kind": "B2", "patent_title": "Systems and methods for suppressing repetitive notifications about messages in messaging groups", "patent_abstract": "The present disclosure relates to systems and methods for suppressing repetitive notifications about messages in messaging groups. In one implementation, the system may include a memory storing instructions and a processor configured to execute the instructions. The instructions may include instructions to determine whether a first message in a first message group substantially matches a second message in a second message group; and after it is determined that a user associated with the first message group has accessed the first message, record the second message as a read message responsive to having determined that the same user is associated with the second message group.", "patent_id": "10812435"}, {"patent_number": "10813105", "patent_date": "2020-10-20", "patent_num_combined_citations": "30", "patent_kind": "B2", "patent_title": "Telecommunication arrangement and procedures to establish a RTC connection between a first and second endpoint", "patent_abstract": "A telecommunication system and a method for generating a real time connection between a first endpoint and a second endpoint in an IP network using an ICE STUN connectivity check follow a procedure that includes the steps of generating a list of possible connection paths between the first endpoint and the second endpoint, establishing a respective priority for each possible connection path included in the list, and generating the real time connection between the first endpoint and the second endpoint. During this procedure first there is an attempt to generate the real time connection using the highest-priority connection path. If this is not possible, then the system attempts to establish the real connection using the connection path with the next highest priority, until the real time connection is actually established. Furthermore, for each possible connection path, its respective quality-of-service value is determined and is considered when establishing its priority on the list.", "patent_id": "10813105"}, {"patent_number": "10819532", "patent_date": "2020-10-27", "patent_num_combined_citations": "4", "patent_kind": "B1", "patent_title": "System and method for determining a source and topic of content for posting in a chat group", "patent_abstract": "A system for determining a source and topic of content for posting in a chat group is disclosed. The system includes a memory and at least one processor. The at least one processor may be configured to perform operations including identifying a user as a source of content; identifying a topic from the content using a language analysis application; determining, from the identified topic, a particular chat group from among a set of chat groups; and posting a portion of the content as a new message from the user in a message thread for the particular chat group.", "patent_id": "10819532"}, {"patent_number": "10819765", "patent_date": "2020-10-27", "patent_num_combined_citations": "20", "patent_kind": "B2", "patent_title": "Method and system for negotiation of media between communication devices for multiplexing multiple media types", "patent_abstract": "A method of negotiation of media between a source communication device and a destination communication device for multiplexing multiple media types on an IP transport address comprises the source communication device generating an offer message comprising an extension to the ICE protocol according to RFC 5245 to specify the IP transport address whereon the multiple media types can be multiplexed, wherein the offer message comprising the extension indicates support for both the multiplexing and a non-multiplexing of the multiple media types, and sending the offer message from the source communication device to the destination communication device.", "patent_id": "10819765"}, {"patent_number": "10831336", "patent_date": "2020-11-10", "patent_num_combined_citations": "25", "patent_kind": "B2", "patent_title": "Method, device, and system for providing indicia on a display", "patent_abstract": "A display of an icon includes creating and displaying an icon that provides indicia regarding information relevant to an application to which the icon is assigned. The indicia provides information to a user and is always in the foreground of a display when the application is running regardless of whether the application is currently actively in use and being interacted with by a user or not. At least one expandable indicia is included within the icon. Input provided by clicking the expandable indicia actuates an expanded window for displaying more detailed information. Indicia is also presentable on the icon to provide real time information to a user who is actively using another application such as whether a connection to a server hosting services for the application is lost. A presence state of the user is displayable via presence indicia located on the icon as well.", "patent_id": "10831336"}, {"patent_number": "10860713", "patent_date": "2020-12-08", "patent_num_combined_citations": "15", "patent_kind": "B2", "patent_title": "Data breach detection system", "patent_abstract": "A method includes receiving marketing campaign associated data. The marketing campaign associated data is data associated with telephony communications from one or more telemarketing sources to a plurality of users. The method further includes applying a machine learning algorithm to the received marketing campaign associated data that determines anomalies associated with a subset of users of the plurality of users. The anomalies are determined based on audio signature of the telephony communications or based on telephony communications from a same source being disguised as different sources. The method includes identifying a marketing content within the telephony communications for the subset of users. The method also includes determining one or more common attributes between users within the subset of users and identifying a source of data breach based on the marketing content and further based on the one or more common attributes.", "patent_id": "10860713"}, {"patent_number": "10868841", "patent_date": "2020-12-15", "patent_num_combined_citations": "7", "patent_kind": "B1", "patent_title": "Voice over internet protocol (VoIP) call quality", "patent_abstract": "A method for improving Voice over Internet Protocol (VoIP) call quality is disclosed. The method includes detecting, at a first computing device, a delay in receiving content data during a first media exchange. The first media exchange uses a first port. The method further includes automatically selecting a second port. The method also includes sending a port change notification featuring a port number of the second port to a second computing device. In some embodiments, the method further includes initiating a second media exchange using the second port.", "patent_id": "10868841"}, {"patent_number": "10880231", "patent_date": "2020-12-29", "patent_num_combined_citations": "5", "patent_kind": "B2", "patent_title": "Systems and methods for determining routing information for a network request", "patent_abstract": "Systems and methods are disclosed for processing a request for network resources in a network comprising at least one endpoint a first pool of destinations. According to certain embodiments, a first request is received from an endpoint. A determination of whether to validate a first destination identifier associated with the first request is made based on at least one of a first timestamp and a first pool identifier associated with the first request. If it is determined to validate the first destination identifier, a target destination identifier is determined, and the first request is forwarded based on the target destination identifier. The requested network resource is received, and is transmitted to the endpoint.", "patent_id": "10880231"}, {"patent_number": "7702669", "patent_date": "2010-04-20", "patent_num_combined_citations": "6", "patent_kind": "B2", "patent_title": "Synchronization in unified messaging systems", "patent_abstract": "A unified messaging system, method, apparatus, individual components and the like are disclosed. The unified messaging system comprises a server, a client and a synchronization application for synchronizing voicemail messages and fax messages on both the server and the client is disclosed. The server messages may include received messages and sent messages, each of which is indexed according to their respective indices and read/unread statuses. Similarly, the client messages may include received messages and sent messages, each of which is indexed according to their respective indices and read/unread statuses.", "patent_id": "7702669"}, {"patent_number": "8134727", "patent_date": "2012-03-13", "patent_num_combined_citations": "2", "patent_kind": "B1", "patent_title": "Message preview control", "patent_abstract": "Embodiments of the invention relate generally to computing devices and systems, as well as software, computer programs, applications, and user interfaces, and more particularly, to systems, devices and methods to facilitate message preview control. For example, the method may include generating representations for messages to present on an interface, and detecting selection of the representation for the message. Further, the method can include presenting preview information for the message, which can be an electronic facsimile. The representations for the messages can include a representation for an electronic facsimile, as well as a voice message and an email.", "patent_id": "8134727"}, {"patent_number": "8204479", "patent_date": "2012-06-19", "patent_num_combined_citations": "5", "patent_kind": "B2", "patent_title": "Line number porting for mobile devices", "patent_abstract": "Methods, systems, apparatus including computer program products having instructions for porting numbers are provided. In one example system and method, a vPBX system can receive a request from a user to port an existing phone number to the vPBX system. The vPBX server can identify a porting authentication template, based on the requirements of an existing service provider. The vPBX server generate a fax document on the retrieved template. The vPBX server can populate the generated fax document with user information. The vPBX server can receive a user's hand signature from a touch-screen interface of a mobile device. The vPBX server can authenticate the fax document with the received signature, and transmit the authenticated fax document to the existing service provider. The vPBX server can provide the user with a temporary line number with forwarding functions until porting is completed.", "patent_id": "8204479"}, {"patent_number": "8213587", "patent_date": "2012-07-03", "patent_num_combined_citations": "212", "patent_kind": "B2", "patent_title": "Inbound call identification and management", "patent_abstract": "Examples of inbound call identification and management are described including a call management system that includes one or more repositories that can include data representing call action policies and data representing attributes associated with the caller devices and the callee devices. Further, the call management system can include one or more computing devices that include a call identifier (“IDer”) configured to characterize the attributes of the caller devices to form characterized attributes, a call management system controller configured to match the characterized attributes against routing criteria specified in the data representing the call action policies, and a call management system router configured to route calls from the caller devices to the callee devices responsive to a match between the characterized attributes and the routing criteria.", "patent_id": "8213587"}, {"patent_number": "8275110", "patent_date": "2012-09-25", "patent_num_combined_citations": "207", "patent_kind": "B2", "patent_title": "Active call filtering, screening and dispatching", "patent_abstract": "An examples of active call filtering, screening and dispatching is described, including receiving data representing a call from a first communication endpoint; presenting at a second communication endpoint, prior to connecting to the call, a subset of prompts that specify dispatching actions for the call, at least one of the dispatching actions including transmitting a response via a communications network, detecting selection of a prompt that specifies a dispatching action for the call, and transmitting an instruction from the second communication endpoint to a call messaging system to perform the dispatching action. In some embodiments, a determination is made as to whether a bypass condition exists, the bypass condition specifying that one or more customized screening rules are to be bypassed. If the bypass condition exists, then a call messaging system can bypass the use of a subset of prompts.", "patent_id": "8275110"}, {"patent_number": "8285267", "patent_date": "2012-10-09", "patent_num_combined_citations": "47", "patent_kind": "B2", "patent_title": "Synchronization in unified messaging systems", "patent_abstract": "In one embodiment, a HTTP connection is established from a phone that serves as a client to a server that maintains a mailbox. The mailbox includes fax messages each having properties that indicate a sender and a state that indicates at least a status of read or unread. The phone that serves as the client permits a user to view one or more of the fax messages. The states of fax messages at the server are received at the phone that serves as the client using the HTTP connection. The states of corresponding fax messages are identified at the phone that serves as the client. One or more synchronization actions are performed to synchronize the states of fax messages at the server and the states of the corresponding fax messages at the phone that serves as the client.", "patent_id": "8285267"}, {"patent_number": "8305622", "patent_date": "2012-11-06", "patent_num_combined_citations": "4", "patent_kind": "B1", "patent_title": "Message preview control", "patent_abstract": "Embodiments of the invention relate generally to computing devices and systems, as well as software, computer programs, applications, and user interfaces, and more particularly, to systems, devices and methods to facilitate message preview control. For example, the method may include generating representations for messages to present on an interface, and detecting selection of the representation for the message. Further, the method can include presenting preview information for the message, which can be an electronic facsimile. The representations for the messages can include a representation for an electronic facsimile, as well as a voice message and an email.", "patent_id": "8305622"}, {"patent_number": "8325893", "patent_date": "2012-12-04", "patent_num_combined_citations": "23", "patent_kind": "B2", "patent_title": "Click-to-call attack prevention", "patent_abstract": "System and methods for preventing abusive use of a click-to-call callback function of virtual PBX services are disclosed. In some implementations, a challenge-response procedure can be implemented, and a click-to-call request is allowed when a correct response is timely received. In some implementations, one or more system wide policies can be applied in determining whether a click-to-call request should be allowed or denied. A system policy for blocking and unblocking requests having a particular request parameter (e.g., source IP address) is disclosed. An account specific policy for setting the state of a particular account targeted by a click-to-call request as normal, warning, or blocked, based on the current status of the particular account is also disclosed.", "patent_id": "8325893"}, {"patent_number": "8335498", "patent_date": "2012-12-18", "patent_num_combined_citations": "49", "patent_kind": "B2", "patent_title": "Synchronization in unified messaging systems", "patent_abstract": "In one embodiment, a server maintains a plurality of fax messages associated with a user. Each fax message of the plurality of fax messages has a state that indicates at least a status of read or unread for the fax message. A HTTP connection is established between the server and a phone that serves as a client through which the plurality of fax messages are viewable. States of one or more fax messages are identified at the server and at the phone that serves as the client. One or more synchronization actions are performed, using the HTTP connection, to synchronize the one or more fax messages at the server and the one or more corresponding fax messages at the phone that serves as the client.", "patent_id": "8335498"}, {"patent_number": "8335851", "patent_date": "2012-12-18", "patent_num_combined_citations": "34", "patent_kind": "B1", "patent_title": "Network resource deployment for cloud-based services", "patent_abstract": "Techniques are described which simplify and/or automate many of the tasks associated with the configuration, deployment, and management of network resources to support cloud-based services.", "patent_id": "8335851"}, {"patent_number": "8355496", "patent_date": "2013-01-15", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "Call management interfaces", "patent_abstract": "Systems, methods and computer program products for generating and displaying various user interfaces for configuring one or more call handling rules associated with managing virtual PBX services rendered at an extension are described. The user interfaces can be used to configure virtual PBX services for a single- or multi-extension environment. The virtual PBX services can provide, for example, a main number, and calls made to the main number can be managed according to one or more sets of call handling rules associated with the virtual PBX services and which can be configured through the user interfaces. The user interfaces can be web-based interfaces accessible through a browser, and can be accessed only after a user or administrator has setup and activated the virtual PBX services.", "patent_id": "8355496"}, {"patent_number": "8369265", "patent_date": "2013-02-05", "patent_num_combined_citations": "38", "patent_kind": "B2", "patent_title": "Remote call control for mobile telecommunication devices and services", "patent_abstract": "System and methods for providing telecommunication functions on a mobile device are disclosed. An inbound call request is received, a call control interface is presented for a user to choose among a plurality of communication modes by which an inbound call is to be established. Call control data selecting a mode of communication is received through the call control interface. Communication is established according to the selected mode of communication. An outbound call request identifying a callee device is send from a mobile device through a packet network to a telecommunication service provider, and a call connection from the mobile device to the telecommunication service provider is established through the telecom network. The telecommunication service provider places a call to the callee device and combines the call connection from the mobile device to the connection to the callee device to establish a single joint call connection.", "patent_id": "8369265"}, {"patent_number": "8369847", "patent_date": "2013-02-05", "patent_num_combined_citations": "40", "patent_kind": "B1", "patent_title": "Mobile devices having a common communication mode", "patent_abstract": "A second communication mode can be enabled for a source device and a destination device. Each device can be a mobile device having a first communication mode and a default number for the first communication mode. The default numbers for the source device and the destination device can be stored. A call request can be received from the source device operating in the second communication mode. The call request can be directed to the default number of the destination device. The destination device can be determined as a client based on the default number of the destination device. A communication session can be established between the source device and the destination device over a network upon determining the destination device is an active client.", "patent_id": "8369847"}, {"patent_number": "8384942", "patent_date": "2013-02-26", "patent_num_combined_citations": "4", "patent_kind": "B1", "patent_title": "Message preview control", "patent_abstract": "Embodiments of the invention relate generally to computing devices and systems, as well as software, computer programs, applications, and user interfaces, and more particularly, to systems, devices and methods to facilitate message preview control. For example, the method may include generating representations for messages to present on an interface, and detecting selection of the representation for the message. Further, the method can include presenting preview information for the message, which can be an electronic facsimile. The representations for the messages can include a representation for an electronic facsimile, as well as a voice message and an email.", "patent_id": "8384942"}, {"patent_number": "8433797", "patent_date": "2013-04-30", "patent_num_combined_citations": "20", "patent_kind": "B2", "patent_title": "User interface for accessing messages", "patent_abstract": "Described herein are systems and methods for providing a message UI engine for accessing messages on a message system. The message system may comprise a message storage system (that store messages of varying types and formats, such as fax, text, voice/audio, video, and picture messages) and a message access system. The message UI engine is configured by a Flash media UI file for accessing messages and associated message information by interacting with the message access system. The Flash media UI file does not comprise any markup language and comprises only Flash® instructions. The Flash media UI file also comprises a plurality of embedded applications for presenting the plurality of different message types, each embedded application comprising only Flash instructions. The associated message information may be stored and transmitted in a non-markup language format, such as comma-delimited format. The messages and message information may be transmitted using a non-HTTP protocol.", "patent_id": "8433797"}, {"patent_number": "8452864", "patent_date": "2013-05-28", "patent_num_combined_citations": "54", "patent_kind": "B1", "patent_title": "Network resource deployment for cloud-based services", "patent_abstract": "Techniques are described which simplify and/or automate many of the tasks associated with the configuration, deployment, and management of network resources to support cloud-based services.", "patent_id": "8452864"}, {"patent_number": "8467514", "patent_date": "2013-06-18", "patent_num_combined_citations": "52", "patent_kind": "B1", "patent_title": "Cross-platform presence", "patent_abstract": "Systems, methods, and computer program products for providing cross-platform presence are described. In some implementations, a cross-platform presence server can be provided that allows a caller to accurately assess the availability and other similar status of a callee by evaluating a device status of a plurality of communication devices associated with the callee. The cross-platform presence server can then determine, based on these device statuses, whether a callee is available. The availability of the callee can subsequently be displayed to the caller (e.g., on the caller's phone), or any other individuals who have been granted permission by the callee to be notified of the callee's availability.", "patent_id": "8467514"}, {"patent_number": "8483367", "patent_date": "2013-07-09", "patent_num_combined_citations": "4", "patent_kind": "B1", "patent_title": "Messaging in a hosted private branch exchange", "patent_abstract": "A hosted private branch exchange (PBX) system is provided that includes: non-transitory storage that includes subscriber identifying information that identifies a subscriber to a message routing service; non-transitory storage that includes distribution rules information associated with the identified subscriber; and a message management server configured to receive a message sent over the Internet to the identified subscriber and to send the message over the Internet to one or more devices according to the distribution rules associated with the identified subscriber.", "patent_id": "8483367"}, {"patent_number": "8548143", "patent_date": "2013-10-01", "patent_num_combined_citations": "228", "patent_kind": "B2", "patent_title": "Inbound call identification and management", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for inbound call identification and management. One of the systems includes one or more repositories that can include data representing call action policies and data representing attributes associated with the caller devices and the callee devices; and one or more computing devices that include a call identifier (“IDer”) configured to characterize the attributes of the caller devices to form characterized attributes, a call management system controller configured to match the characterized attributes against routing criteria specified in the data representing the call action policies, and a call management system router configured to route calls from the caller devices to the callee devices responsive to a match between the characterized attributes and the routing criteria.", "patent_id": "8548143"}, {"patent_number": "8582733", "patent_date": "2013-11-12", "patent_num_combined_citations": "37", "patent_kind": "B1", "patent_title": "Phone system with methodology for call parking", "patent_abstract": "A phone system with a methodology for call parking is described. According to one embodiment of the present invention, a user of a communications endpoint device can use a user interface at the communications endpoint device to select persons to notify of a parked call. Upon successfully parking the call, the phone system notifies the selected persons in the manner specified in their account profiles. Such manner can include sending an e-mail to the selected person or sending a text message to the selected person. Advantageously, the manner for notifying the selected persons of the parked call is determined by the selected persons themselves through configuration of their account profiles thereby alleviating the user parking the call from having to determine the manner for notifying the selected persons.", "patent_id": "8582733"}, {"patent_number": "8588744", "patent_date": "2013-11-19", "patent_num_combined_citations": "9", "patent_kind": "B2", "patent_title": "Fraud prevention techniques", "patent_abstract": "System, apparatus, computer program products and methods for preventing fraud attacks (e.g., on a virtual PBX service provider) are disclosed. In some implementations, a set of fraud evaluation processes are performed, an overall fraud evaluation score is incremented as each of the set of fraud evaluation processes are performed and a step result is obtained. A user request (e.g., account activation) can be denied or accepted based on the overall fraud evaluation score. In some implementations, the set of fraud evaluation processes can include one or more of: an internal fraud evaluation process, a process for checking multiple trial accounts associated with a common account parameter, a process for geolocation verification of multiple account parameters, a process for device type verification for a contact phone number, a process for credit card verification, and a process for placing a contact number verification call.", "patent_id": "8588744"}, {"patent_number": "8600363", "patent_date": "2013-12-03", "patent_num_combined_citations": "19", "patent_kind": "B2", "patent_title": "Synchronization in unified messaging systems", "patent_abstract": "A unified messaging system, method, apparatus, individual components and the like are disclosed. The unified messaging system comprises a server, a client and a synchronization application for synchronizing voicemail messages and fax messages on both the server and the client is disclosed. The server messages may include received messages and sent messages, each of which is indexed according to their respective indices and read/unread statuses. Similarly, the client messages may include received messages and sent messages, each of which is indexed according to their respective indices and read/unread statuses.", "patent_id": "8600363"}, {"patent_number": "8600391", "patent_date": "2013-12-03", "patent_num_combined_citations": "228", "patent_kind": "B2", "patent_title": "Call management for location-aware mobile devices", "patent_abstract": "A positioning system (e.g., GPS) integrated in, or coupled to, a mobile device determines the position of the mobile device. An availability status manager (ASM) in a vPBX acquires the position of the mobile device. The ASM can contain rules on how to route or otherwise control incoming phone calls based on availability status of one or more mobile devices in the vPBX network. When a call is received by the vPBX, the ASM determines the availability status of the receiving mobile device based on the geographic location of the receiving mobile device. The ASM then routes the call to the receiving mobile device, to another mobile device, or to a landline based on the availability status of the receiving mobile device and the availability status based rules.", "patent_id": "8600391"}, {"patent_number": "8606938", "patent_date": "2013-12-10", "patent_num_combined_citations": "9", "patent_kind": "B1", "patent_title": "High availability for cloud-based services", "patent_abstract": "High availability mechanisms are described for cloud-based services such as voice-over-IP (VoIP) services.", "patent_id": "8606938"}, {"patent_number": "8611879", "patent_date": "2013-12-17", "patent_num_combined_citations": "9", "patent_kind": "B2", "patent_title": "Bridge line appearance for location-aware mobile devices", "patent_abstract": "A vPBX server manages calls in a bridged line appearance (BLA) group. A BLA group can include extensions for location-aware mobile devices. The vPBX server contains location based forwarding rules that can be applied together with BLA redirection rules in managing incoming calls. A single extension can appear as a user interface element (e.g., an icon or button) on multiple mobile devices. Using the user interface element, a primary user can view a secondary user's status, including the secondary user's location information. The vPBX server allows the primary user to redirect the incoming calls to devices in accordance with the forwarding rules and the redirection rules.", "patent_id": "8611879"}, {"patent_number": "8638913", "patent_date": "2014-01-28", "patent_num_combined_citations": "15", "patent_kind": "B2", "patent_title": "System and method for accessing a visual phone menu", "patent_abstract": "A system and method for providing access to a visual phone menu is disclosed. The system receives a phone number transmitted from a calling device to initiate a call, determines whether a visual phone menu (VPM) is available for the phone number, provides the calling device with a VPM address when a VPM exists, and proceeds with the call from the calling device to the phone number when a VPM does not exist.", "patent_id": "8638913"}, {"patent_number": "8644485", "patent_date": "2014-02-04", "patent_num_combined_citations": "6", "patent_kind": "B1", "patent_title": "Intelligent softswitch for managing a call", "patent_abstract": "Systems, methods and computer program products for managing a call are described. In some implementations, an intelligent softswitch can be used to communicate with a provider system that can relay or switch one or more outbound calls initiated by a caller and intended for a subscriber to the intelligent softswitch. Upon receiving the relayed call, the intelligent softswitch can process the relayed call using one or more call handling rules that have been specified by the subscriber. After processing, the relayed call is routed back to the provider system for completing the call.", "patent_id": "8644485"}, {"patent_number": "8670529", "patent_date": "2014-03-11", "patent_num_combined_citations": "2", "patent_kind": "B1", "patent_title": "Context aware help system", "patent_abstract": "A context aware help system generates context data for web sessions. The context data may be used either by a human operator or by an automated response system to help resolve user web session problems. For example, a user may initiate a telephone call to the context aware help during a web session. The context data may be displayed to a telephone operator in response to the telephone call. The telephone operator may use the context data to determine what web pages and user inputs were previously entered during the web session. This allows the telephone operator to quickly analyze web session problems and provide more effective and efficient web session support. The help system may alternatively, or in addition, provide other types of automated audio or data support.", "patent_id": "8670529"}, {"patent_number": "8670545", "patent_date": "2014-03-11", "patent_num_combined_citations": "234", "patent_kind": "B2", "patent_title": "Inbound call identification and management", "patent_abstract": "Examples of inbound call identification and management are described including a call management system that includes one or more repositories that can include data representing call action policies and data representing attributes associated with the caller devices and the callee devices. Further, the call management system can include one or more computing devices that include a call identifier (“IDer”) configured to characterize the attributes of the caller devices to form characterized attributes, a call management system controller configured to match the characterized attributes against routing criteria specified in the data representing the call action policies, and a call management system router configured to route calls from the caller devices to the callee devices responsive to a match between the characterized attributes and the routing criteria.", "patent_id": "8670545"}, {"patent_number": "8681968", "patent_date": "2014-03-25", "patent_num_combined_citations": "207", "patent_kind": "B2", "patent_title": "Techniques for bypassing call screening in a call messaging system", "patent_abstract": "A system, method, and computer-readable media for bypassing call screening in a call messaging system includes storing a call screening rule for a callee specifying one or more conditions under which the call screening rule applies to an incoming call to the callee and specifying one or more call screening actions to take when an incoming call to the callee is received under the one or more conditions. When an incoming call from the caller's device to the callee's device is received under the one or more conditions of the call screening rule, a determination is made whether a bypass condition exists, and if a bypass condition exists, the incoming call is connected to the callee's device without taking the one or more call screening actions.", "patent_id": "8681968"}, {"patent_number": "8693655", "patent_date": "2014-04-08", "patent_num_combined_citations": "6", "patent_kind": "B1", "patent_title": "System and method for provisioning temporary telephone numbers", "patent_abstract": "Systems, methods, and computer program products for provisioning a temporary disposable number are described. A user can be provided with a pool of available temporary disposable numbers that have a limited shelf life. The user can select one of the available temporary disposable numbers while submitting a permanent phone number associated with a communications device (e.g., mobile phone, home phone, business phone, etc.). Prior to activating the selected temporary disposable number, the temporary disposable number is linked to the permanent phone number. After activation, when an incoming call to the temporary disposable number is received, the permanent phone number is identified to be associated with the temporary disposable number being called. The incoming call is then forwarded to the communications device on which the permanent phone number is established.", "patent_id": "8693655"}, {"patent_number": "8780383", "patent_date": "2014-07-15", "patent_num_combined_citations": "234", "patent_kind": "B2", "patent_title": "Authenticated facsimile transmission from mobile devices", "patent_abstract": "A fax document can be either uploaded to a fax server in a vPBX network or generated dynamically. For dynamic generation, pre-configured templates can be stored either on a mobile device or on a fax server. A user can use a mobile device connected to a vPBX network as a controlling device to direct generation of faxes on a fax server. The generation of faxes can be customized based on a geographic location of the mobile device. The generated fax can be downloaded onto a mobile device. The user can digitally sign the fax using a touch-screen input device on the mobile device. The digitally signed fax can be transmitted to a destination device.", "patent_id": "8780383"}, {"patent_number": "8780400", "patent_date": "2014-07-15", "patent_num_combined_citations": "35", "patent_kind": "B2", "patent_title": "Message preview control", "patent_abstract": "Embodiments of the invention relate generally to computing devices and systems, as well as software, computer programs, applications, and user interfaces, and more particularly, to systems, devices and methods to facilitate message preview control. For example, the method may include generating representations for messages to present on an interface, and detecting selection of the representation for the message. Further, the method can include presenting preview information for the message, which can be an electronic facsimile. The representations for the messages can include a representation for an electronic facsimile, as well as a voice message and an email.", "patent_id": "8780400"}, {"patent_number": "8787367", "patent_date": "2014-07-22", "patent_num_combined_citations": "3", "patent_kind": "B2", "patent_title": "User partitioning in a communication system", "patent_abstract": "Systems and methods for routing an incoming service request to one of a plurality of pod units are described. A communication system can be provided that includes a plurality of pods each having a first pod serving a first subset of user accounts associated with a hosted PBX system. The first pod can include a first pod unit in a first data center and a second pod unit in a second data center. A global user directory (GUD) can be used to store a plurality of user keys that are mapped to the plurality of pods. A router can be provided to identify a user key from an incoming service request, query the GUD to identify the first pod as being associated with the user key, and route the incoming service request to one of the first and second pod units.", "patent_id": "8787367"}, {"patent_number": "8792118", "patent_date": "2014-07-29", "patent_num_combined_citations": "237", "patent_kind": "B2", "patent_title": "User interfaces and methods to provision electronic facsimiles", "patent_abstract": "Embodiments of the invention relate generally to computing devices and systems, as well as software, computer programs, applications, and user interfaces, and more particularly, to provisioning electronic fax messages in a communication network including packetized and/or synchronous communications. According to one embodiment, a messaging can receive data representing an electronic document in a file format into a messaging system, convert fax components to a fax compatible format including the electronic document in the file format to form converted fax components, determine whether to generate an electronic facsimile to include the fax components as a pre-rendered electronic facsimile, and transmit the electronic facsimile as the pre-rendered electronic facsimile.", "patent_id": "8792118"}, {"patent_number": "8805399", "patent_date": "2014-08-12", "patent_num_combined_citations": "9", "patent_kind": "B2", "patent_title": "Dock station for mobile devices", "patent_abstract": "Systems, methods and computer program products for processing a call as between a mobile device and a linked base telephone system are described. A phone docking station allows the mobile device to be linked to the base telephone system. Features of either the mobile device or the base telephone system may be used to support a call. For example, through the phone docking station, one or more features and functions of the mobile device may be enabled on or supported by the base telephone system.", "patent_id": "8805399"}, {"patent_number": "8817963", "patent_date": "2014-08-26", "patent_num_combined_citations": "65", "patent_kind": "B2", "patent_title": "Cross-platform presence", "patent_abstract": "Systems, methods, and computer program products for providing cross-platform presence are described. In some implementations, a cross-platform presence server can be provided that allows a caller to accurately assess the availability and other similar status of a callee by evaluating a device status of a plurality of communication devices associated with the callee. The cross-platform presence server can then determine, based on these device statuses, whether a callee is available. The availability of the callee can subsequently be displayed to the caller (e.g., on the caller's phone), or any other individuals who have been granted permission by the callee to be notified of the callee's availability.", "patent_id": "8817963"}, {"patent_number": "8830878", "patent_date": "2014-09-09", "patent_num_combined_citations": "6", "patent_kind": "B1", "patent_title": "Handling connections to reassigned numbers", "patent_abstract": "Techniques are described for better ensuring that calls or transmissions directed to a subscriber or endpoint to which a number was previously assigned are not received by a new subscriber or endpoint. According to one class of implementations, a telephony platform maintains a registry that associates a secondary identifier with each phone number that is currently assigned to a subscriber. The identifier may point to and/or include any of a variety of information that maps to the current subscriber. When a calling party initiates a call to an assigned number, an additional identifier is transmitted with the call routing information that corresponds to the entity or endpoint to which the call is directed. The telephony platform makes call routing decisions based on the correspondence of this information with the information maintained in the registry.", "patent_id": "8830878"}, {"patent_number": "8831191", "patent_date": "2014-09-09", "patent_num_combined_citations": "49", "patent_kind": "B1", "patent_title": "Call preview system", "patent_abstract": "A caller may initiate a phone call to a device. A call preview system may send a preview message in conjunction with the phone call. The preview message may contain preview information that identifies the caller. The call preview system may use a text or media messaging service to send the preview message. Callers can manage their own preview information relieving each user from continuously updating contact information in personal contact directories. The call preview system may use different schemes for initiating phone calls. In one example, the call preview system may initiate or forward phone calls in conjunction with sending the preview message. In another example, the call preview system may delay calling a phone number or delay forwarding the phone call until a message is received acknowledging the preview message or accepting the phone call.", "patent_id": "8831191"}, {"patent_number": "8831597", "patent_date": "2014-09-09", "patent_num_combined_citations": "59", "patent_kind": "B1", "patent_title": "Unified caller identification across multiple communication modes", "patent_abstract": "A mobile device is adapted to operate in a first communication mode and a second communication mode. An identifier is acquired for a mobile device, wherein the identifier is sent to identify the mobile device when the mobile device places a call in the first communication mode. A call is placed to a destination device while the mobile device operates in the second communication mode. The same identifier is sent to the destination device while the mobile device operates in the second communication mode. The mobile device is served by a first service provider while it operates in the first communication mode. The mobile device is served by a second service provider while it operates in the second communication mode, the second service provider being different from the first service provider.", "patent_id": "8831597"}, {"patent_number": "8838082", "patent_date": "2014-09-16", "patent_num_combined_citations": "232", "patent_kind": "B2", "patent_title": "Centralized status server for call management of location-aware mobile devices", "patent_abstract": "Systems, methods and computer program products for utilizing location information in a virtual private branch exchange (vPBX) system are described. In some implementations, the vPBX system can use the location information to determine an availability status of a user of a mobile device (e.g., out of the office, in the office, at home, busy, and the like). The vPBX system can obtain the geographic coordinates of the mobile device and correlate these coordinates with known coordinates for locations associated with the user (e.g., the user's office, home, or other predefined locations). An inference of the user's availability can then be determined based on the correlation (e.g., whether the user is currently out of the user's office, at the user's home, or at another location). The user's availability can be made available to other users associated with the vPBX system, and can be used for call management (e.g., routing).", "patent_id": "8838082"}, {"patent_number": "8838169", "patent_date": "2014-09-16", "patent_num_combined_citations": "73", "patent_kind": "B2", "patent_title": "Provisioning interfaces for accessing virtual private branch exchange services through a mobile device", "patent_abstract": "Systems, methods and computer program products for facilitating the provisioning of a single and multi-line virtual private branch exchange (PBX) including automated call distribution via a mobile device are described. In some implementations, the provisioning of the single and multi-line virtual PBX can be achieved using one or more unique provisioning interfaces. The unique provisioning interfaces can enable the setup and configuration of a virtual PBX service account instantaneously from any geographical location at anytime. Changes made to the virtual PBX service account can be immediately reflected back (e.g., in real-time) to the system providing the core operating environment.", "patent_id": "8838169"}, {"patent_number": "8848689", "patent_date": "2014-09-30", "patent_num_combined_citations": "9", "patent_kind": "B1", "patent_title": "Telephony application platform", "patent_abstract": "A hosted private branch exchange (PBX) platform includes associated application programming interfaces (APIs) that provide a range of integration points with the PBX platform that, in turn, enables the development of a broad range of applications that can customize and/or enhance the basic functionality of the underlying PBX platform.", "patent_id": "8848689"}, {"patent_number": "8862180", "patent_date": "2014-10-14", "patent_num_combined_citations": "32", "patent_kind": "B2", "patent_title": "Instant activation and provisioning for telecommunication services on a mobile device", "patent_abstract": "Methods and systems for instant activation of virtual PBX services on a mobile device are disclosed. In one aspect, a user request for activating virtual PBX services is received on a mobile device. An available primary identification number for the virtual PBX services is retrieved from a telecommunication service provider (TSP). A user interface is presented on the mobile device including a first interface portion presenting the available primary identification number and a second interface portion configured to receive a user identifier. Upon receiving the user input specifying the user identifier and while the user interface is still presented on the mobile device, a user instruction for activating the virtual PBX services is received. Upon receiving the user instruction, the user identifier is sent to the TSP. Then, a confirmation is received from the TSP.", "patent_id": "8862180"}, {"patent_number": "8867710", "patent_date": "2014-10-21", "patent_num_combined_citations": "9", "patent_kind": "B2", "patent_title": "Messaging in a hosted private branch exchange", "patent_abstract": "A hosted private branch exchange (PBX) system is provided that includes: non-transitory storage that includes subscriber identifying information that identifies a subscriber to a message routing service; non-transitory storage that includes distribution rules information associated with the identified subscriber; and a message management server configured to receive a message sent over the Internet to the identified subscriber and to send the message over the Internet to one or more devices according to the distribution rules associated with the identified subscriber.", "patent_id": "8867710"}, {"patent_number": "8885809", "patent_date": "2014-11-11", "patent_num_combined_citations": "208", "patent_kind": "B2", "patent_title": "Techniques for bypassing call screening in a call messaging system", "patent_abstract": "Techniques for bypassing call screening in a call messaging system. In one embodiment, for example, a method performed by one or more computing devices comprises: receiving an incoming call from a device of a caller; determining whether a bypass condition exists for the incoming call; and in response to determining that the bypass condition exists, causing the incoming call to be connected to a device of a callee without performing a call screening action of a call screening rule that, based at least in part on one or more conditions of the call screening rule, applies to the incoming call.", "patent_id": "8885809"}, {"patent_number": "8885813", "patent_date": "2014-11-11", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "Call queuing for location-aware mobile devices", "patent_abstract": "A mobile device can be assigned to an extension configured as a Queue Agent (“QA”) in a call-queuing enabled virtual private branch exchange (vPBX). This and other mobile or fixed devices can be interconnected to form a virtual call center. Each extension can be assigned various rules, which specify how the incoming calls are answered at the extension and how calls in the call queue are selected for answering by the QA. As part of the rules, the vPBX system forwards calls from a call queue to the QA based on QA's availability status. If a location-aware mobile device is associated with the QA, the vPBX system can determine the QA's availability status based on a geographic location of the mobile device. A most geographically proximate agent can be selected for answering the call.", "patent_id": "8885813"}, {"patent_number": "8891737", "patent_date": "2014-11-18", "patent_num_combined_citations": "12", "patent_kind": "B2", "patent_title": "Call management interfaces", "patent_abstract": "Systems, methods and computer program products for generating and displaying various user interfaces for configuring one or more call handling rules associated with managing virtual PBX services rendered at an extension are described. The user interfaces can be used to configure virtual PBX services for a single- or multi-extension environment. The virtual PBX services can provide, for example, a main number, and calls made to the main number can be managed according to one or more sets of call handling rules associated with the virtual PBX services and which can be configured through the user interfaces. The user interfaces can be web-based interfaces accessible through a browser, and can be accessed only after a user or administrator has setup and activated the virtual PBX services.", "patent_id": "8891737"}, {"patent_number": "8909695", "patent_date": "2014-12-09", "patent_num_combined_citations": "8", "patent_kind": "B1", "patent_title": "Accessing user messages at a hosted communications provider", "patent_abstract": "A hosted communications provider or network supports communications to multiple users, each having associated accounts. The network includes memory storage device(s) for storing communications message(s) directed to one or more of the users. A web server module is configured to receive access requests for the user accounts; such requests originating from a user device. The network provides the requested access and sends the information using a non HTML format for at least a portion of the information. The user device displays the requested information on a display device. In some implementations, the information is sent to the user in a non-HTML format. In some implementations, at least a portion of the user interface is provided in a file format which does not include HTML.", "patent_id": "8909695"}, {"patent_number": "8918513", "patent_date": "2014-12-23", "patent_num_combined_citations": "62", "patent_kind": "B2", "patent_title": "Network resource deployment for cloud-based services", "patent_abstract": "Techniques are described which simplify and/or automate many of the tasks associated with the configuration, deployment, and management of network resources to support cloud-based services.", "patent_id": "8918513"}, {"patent_number": "8934883", "patent_date": "2015-01-13", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "Bridge line appearance for location-aware mobile devices", "patent_abstract": "A vPBX server manages calls in a bridged line appearance (BLA) group. A BLA group can include extensions for location-aware mobile devices. The vPBX server contains location based forwarding rules that can be applied together with BLA redirection rules in managing incoming calls. A single extension can appear as a user interface element (e.g., an icon or button) on multiple mobile devices. Using the user interface element, a primary user can view a secondary user's status, including the secondary user's location information. The vPBX server allows the primary user to redirect the incoming calls to devices in accordance with the forwarding rules and the redirection rules.", "patent_id": "8934883"}, {"patent_number": "8937941", "patent_date": "2015-01-20", "patent_num_combined_citations": "10", "patent_kind": "B1", "patent_title": "Techniques for VoIP provider interconnection over the internet using a shared subscriber contact identifier translation service", "patent_abstract": "VoIP provider interconnection over the Internet using a shared subscriber contact identifier translation service. In one embodiment, for example, a method comprises: receiving a query message from a communications endpoint devices of a calling party, the query message comprising a subscriber contact identifier of a called party; in response to obtaining the query message: identifying a plurality of communications endpoint identifiers associated with the subscriber contact identifier; obtaining reachability information for the plurality of communications endpoint identifiers; and based at least in part on the reachability information, selecting one of the plurality of communications endpoint identifiers; and responding to the query message with a response comprising the selected one of the communications endpoint identifiers. The method then further comprises using the selected communications endpoint identifier to establish a VoIP call between a communications endpoint device of a calling party and a communications endpoint device of a called party.", "patent_id": "8937941"}, {"patent_number": "8954059", "patent_date": "2015-02-10", "patent_num_combined_citations": "66", "patent_kind": "B1", "patent_title": "Mobile devices having a common communication mode", "patent_abstract": "A second communication mode can be enabled for a source device and a destination device. Each device can be a mobile device having a first communication mode and a default number for the first communication mode. The default numbers for the source device and the destination device can be stored. A call request can be received from the source device operating in the second communication mode. The call request can be directed to the default number of the destination device. The destination device can be determined as a client based on the default number of the destination device. A communication session can be established between the source device and the destination device over a network upon determining the destination device is an active client.", "patent_id": "8954059"}, {"patent_number": "8971957", "patent_date": "2015-03-03", "patent_num_combined_citations": "75", "patent_kind": "B2", "patent_title": "Provisioning interfaces for accessing virtual private branch exchange services through a mobile device", "patent_abstract": "Systems, methods and computer program products for facilitating the provisioning of a single and multi-line virtual private branch exchange (PBX) including automated call distribution via a mobile device are described. In some implementations, the provisioning of the single and multi-line virtual PBX can be achieved using one or more unique provisioning interfaces. The unique provisioning interfaces can enable the setup and configuration of a virtual PBX service account instantaneously from any geographical location at any time. Changes made to the virtual PBX service account can be immediately reflected back (e.g., in real-time) to the system providing the core operating environment.", "patent_id": "8971957"}, {"patent_number": "8995627", "patent_date": "2015-03-31", "patent_num_combined_citations": "20", "patent_kind": "B1", "patent_title": "System and method for providing access to a visual phone menu", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for providing access to a visual phone menu is disclosed. One of the methods includes receiving a call request transmitted from a calling device to initiate a call to a recipient; saving state information associated with the caller's navigation through a voice response system; providing an option for the caller to select between receiving a visual phone menu (VPM) or continuing to listen to the voice response system menu; receiving a selection of the option to receive the VPM; providing the VPM to a client device including providing state information associated with the caller's navigation through the voice response system prior to the selection; and using the state information when the caller navigates back in the response tree using the VPM.", "patent_id": "8995627"}, {"patent_number": "9002350", "patent_date": "2015-04-07", "patent_num_combined_citations": "65", "patent_kind": "B1", "patent_title": "Unified caller identification across multiple communication modes", "patent_abstract": "A mobile device is adapted to operate in a first communication mode and a second communication mode. An identifier is acquired for a mobile device, wherein the identifier is sent to identify the mobile device when the mobile device places a call in the first communication mode. A call is placed to a destination device while the mobile device operates in the second communication mode. The same identifier is sent to the destination device while the mobile device operates in the second communication mode. The mobile device is served by a first service provider while it operates in the first communication mode. The mobile device is served by a second service provider while it operates in the second communication mode, the second service provider being different from the first service provider.", "patent_id": "9002350"}, {"patent_number": "9008625", "patent_date": "2015-04-14", "patent_num_combined_citations": "11", "patent_kind": "B2", "patent_title": "Fraud prevention techniques", "patent_abstract": "System, apparatus, computer program products and methods for preventing fraud attacks (e.g., on a virtual PBX service provider) are disclosed. In some implementations, a set of fraud evaluation processes are performed, an overall fraud evaluation score is incremented as each of the set of fraud evaluation processes are performed and a step result is obtained. A user request (e.g., account activation) can be denied or accepted based on the overall fraud evaluation score. In some implementations, the set of fraud evaluation processes can include one or more of: an internal fraud evaluation process, a process for checking multiple trial accounts associated with a common account parameter, a process for geolocation verification of multiple account parameters, a process for device type verification for a contact phone number, a process for credit card verification, and a process for placing a contact number verification call.", "patent_id": "9008625"}, {"patent_number": "9026636", "patent_date": "2015-05-05", "patent_num_combined_citations": "16", "patent_kind": "B2", "patent_title": "High availability for cloud-based services", "patent_abstract": "High availability mechanisms are described for cloud-based services such as voice-over-IP (VoIP) services.", "patent_id": "9026636"}, {"patent_number": "9037747", "patent_date": "2015-05-19", "patent_num_combined_citations": "7", "patent_kind": "B1", "patent_title": "System and method for processing service requests using logical environments", "patent_abstract": "Systems and methods for processing service requests using logical environments. One of the methods includes receiving, by a router in a communication service provider system, a user service request from a first communication device; determining, by the router, an identifier of a first user of the communication service provider system associated with the first incoming service request; determining, by the router, a logical environment for the first user, wherein the logical environment for the first user identifies a plurality of components of the communication service provider system used to process service requests associated with the first user; identifying, by the router, a first application cluster of a first version of an application identified in the logical environment for the first user; and routing, by the router, the first incoming service request for processing by the first application cluster of the first version of the application.", "patent_id": "9037747"}, {"patent_number": "9049294", "patent_date": "2015-06-02", "patent_num_combined_citations": "148", "patent_kind": "B1", "patent_title": "Methods and systems for speed dialing", "patent_abstract": "Systems and methods enable configuring and using speed dialing. A first user interface is displayed to a user, the first user interface providing a name field configured to display and/or receive a contact name and a phone address field configured to display and/or receive a phone address associated with the contact name. A speed dial field configured to receive and/or display a speed dial identifier associated with the phone address is provided. When the user later enters speed dial identifier via a telephone, the phone address is called.", "patent_id": "9049294"}, {"patent_number": "9059953", "patent_date": "2015-06-16", "patent_num_combined_citations": "49", "patent_kind": "B2", "patent_title": "Message preview control", "patent_abstract": "Embodiments of the invention relate generally to computing devices and systems, as well as software, computer programs, applications, and user interfaces, and more particularly, to systems, devices and methods to facilitate message preview control. For example, the method may include generating representations for messages to present on an interface, and detecting selection of the representation for the message. Further, the method can include presenting preview information for the message, which can be an electronic facsimile. The representations for the messages can include a representation for an electronic facsimile, as well as a voice message and an email.", "patent_id": "9059953"}, {"patent_number": "9060050", "patent_date": "2015-06-16", "patent_num_combined_citations": "25", "patent_kind": "B1", "patent_title": "System and method for determining availability statuses for users", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for determining availability statuses for users of a communication service provider system. One of the methods includes obtaining data identifying a plurality of availability status features for a user of a communication service provider system and a respective weight for each of the availability status features; determining a respective current value of each of the availability status features; and determining an aggregate user availability status based at least in part on the current values of the availability status features and on the weights for the availability status features.", "patent_id": "9060050"}, {"patent_number": "9078115", "patent_date": "2015-07-07", "patent_num_combined_citations": "11", "patent_kind": "B2", "patent_title": "Dock station for mobile devices", "patent_abstract": "Systems, methods and computer program products for processing a call as between a mobile device and a linked base telephone system are described. A phone docking station allows the mobile device to be linked to the base telephone system. Features of either the mobile device or the base telephone system may be used to support a call. For example, through the phone docking station, one or more features and functions of the mobile device may be enabled on or supported by the base telephone system.", "patent_id": "9078115"}, {"patent_number": "9084186", "patent_date": "2015-07-14", "patent_num_combined_citations": "240", "patent_kind": "B2", "patent_title": "Call management for location-aware mobile devices", "patent_abstract": "A positioning system (e.g., GPS) integrated in, or coupled to, a mobile device determines the position of the mobile device. An availability status manager (ASM) in a vPBX acquires the position of the mobile device. The ASM can contain rules on how to route or otherwise control incoming phone calls based on availability status of one or more mobile devices in the vPBX network. When a call is received by the vPBX, the ASM determines the availability status of the receiving mobile device based on the geographic location of the receiving mobile device. The ASM then routes the call to the receiving mobile device, to another mobile device, or to a landline based on the availability status of the receiving mobile device and the availability status based rules.", "patent_id": "9084186"}, {"patent_number": "9104879", "patent_date": "2015-08-11", "patent_num_combined_citations": "3", "patent_kind": "B1", "patent_title": "System and method for detecting security exposures of VOIP devices", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for detecting security exposures of Voice over Internet Protocol (VOIP) devices. One of the methods includes obtaining data identifying a source Internet Protocol (IP) address associated with a communication device that has been provisioned with configuration files for VOIP services; determining that a VOIP phone configuration interface is exposed over an untrusted network at the source IP address; and determining that the communication device associated with the source IP address has a security exposure based at least in part on determining that the VOIP phone configuration interface is exposed over the untrusted network at the source IP address.", "patent_id": "9104879"}, {"patent_number": "9125035", "patent_date": "2015-09-01", "patent_num_combined_citations": "55", "patent_kind": "B2", "patent_title": "Call preview system", "patent_abstract": "A caller may initiate a phone call to a device. A call preview system may send a preview message in conjunction with the phone call. The preview message may contain preview information that identifies the caller. The call preview system may use a text or media messaging service to send the preview message. Callers can manage their own preview information relieving each user from continuously updating contact information in personal contact directories. The call preview system may use different schemes for initiating phone calls. In one example, the call preview system may initiate or forward phone calls in conjunction with sending the preview message. In another example, the call preview system may delay calling a phone number or delay forwarding the phone call until a message is received acknowledging the preview message or accepting the phone call.", "patent_id": "9125035"}, {"patent_number": "9131054", "patent_date": "2015-09-08", "patent_num_combined_citations": "4", "patent_kind": "B2", "patent_title": "Synchronization in unified messaging systems", "patent_abstract": "Techniques for synchronization of fax and/or voice messages in a client-server arrangement are disclosed. In one embodiment, for example, a synchronization method in a phone includes: initiating synchronization of a set of fax and/or voice messages on the phone with a set of fax and/or voice messages on a server; sending a request to the server to receive state of the set of messages on the server; identifying state of the set of messages on the phone; performing a discrepancy assessment between the state of the set of messages on the server and the state of the set of messages on the phone; based on results of the discrepancy assessment, creating a list of synchronization actions to perform for synchronizing the set of messages on the phone with the set of messages on the server; and performing the synchronization actions in the list.", "patent_id": "9131054"}, {"patent_number": "9131063", "patent_date": "2015-09-08", "patent_num_combined_citations": "13", "patent_kind": "B2", "patent_title": "Devices, methods, and graphical user interfaces for performing actions related to selected messages in a message in-box and for transferring calls", "patent_abstract": "Telephonic computing devices having touch screen displays with new and improved methods and user interfaces for performing actions related to selected messages in a message in-box and for transferring calls, thereby increasing the effectiveness, efficiency, and user satisfaction with such devices. Such methods, devices, and interfaces may complement or replace existing methods, devices, and interfaces for performing actions related to selected messages in a message in-box and for transferring calls.", "patent_id": "9131063"}, {"patent_number": "9131069", "patent_date": "2015-09-08", "patent_num_combined_citations": "7", "patent_kind": "B2", "patent_title": "System and method for provisioning temporary telephone numbers", "patent_abstract": "Systems, methods, and computer program products for provisioning a temporary disposable number are described. A user can be provided with a pool of available temporary disposable numbers that have a limited shelf life. The user can select one of the available temporary disposable numbers while submitting a permanent phone number associated with a communications device (e.g., mobile phone, home phone, business phone, etc.). Prior to activating the selected temporary disposable number, the temporary disposable number is linked to the permanent phone number. After activation, when an incoming call to the temporary disposable number is received, the permanent phone number is identified to be associated with the temporary disposable number being called. The incoming call is then forwarded to the communications device on which the permanent phone number is established.", "patent_id": "9131069"}, {"patent_number": "9141673", "patent_date": "2015-09-22", "patent_num_combined_citations": "12", "patent_kind": "B2", "patent_title": "Cloud-based phone system with methodologies for suggesting account configuration settings", "patent_abstract": "A cloud-based phone system with methodologies for suggesting account configuration settings is provided. In one embodiment, for example, techniques are provided for suggesting how a particular user should configure a particular account configuration parameter of a plurality of account configuration parameters available to the particular user. One or more parameters of the plurality of account configuration parameters that are related to the particular parameter are identified. One or more other users are identified that have configured the one or more parameters similar to how the particular user has configured the one or more parameters. A suggestion of how the particular user should configure the particular parameter is made based on settings for the particular parameter made by the one or more other users.", "patent_id": "9141673"}, {"patent_number": "9148456", "patent_date": "2015-09-29", "patent_num_combined_citations": "35", "patent_kind": "B2", "patent_title": "Context aware help system", "patent_abstract": "A context aware help system generates context data for web sessions. The context data may be used either by a human operator or by an automated response system to help resolve user web session problems. For example, a user may initiate a telephone call to the context aware help during a web session. The context data may be displayed to a telephone operator in response to the telephone call. The telephone operator may use the context data to determine what web pages and user inputs were previously entered during the web session. This allows the telephone operator to quickly analyze web session problems and provide more effective and efficient web session support. The help system may alternatively, or in addition, provide other types of automated audio or data support.", "patent_id": "9148456"}, {"patent_number": "9191359", "patent_date": "2015-11-17", "patent_num_combined_citations": "21", "patent_kind": "B2", "patent_title": "Techniques for VoIP provider interconnection over the internet using a shared subscriber contact identifier translation service", "patent_abstract": "A computer-implemented method, an apparatus and a recording medium are provided for facilitating access by a subscriber over a communications network. The method comprises: acquiring a query message comprising a subscriber contact identifier associated with the subscriber; responsive to acquiring the query message: identifying a plurality of communications endpoint identifiers associated with the subscriber contact identifier, each communications endpoint identifier being associated with a communications device and reachability information, wherein the reachability information reflects a degree of subscriber accessibility via the communications device; and providing a response to the query message comprising at least one of the plurality of the communications endpoint identifiers, wherein the at least one of the plurality of the communications endpoint identifiers is selected based at least in part on the reachability information. The recording medium comprises instructions to configure the apparatus to perform the method.", "patent_id": "9191359"}, {"patent_number": "9197701", "patent_date": "2015-11-24", "patent_num_combined_citations": "3", "patent_kind": "B1", "patent_title": "Consolidated peer-to-peer media sessions for audio and/or video communications", "patent_abstract": "System, methods, and non-transitory computer-readable media storing computer-executable instructions for performing the methods are provided for facilitating electronic audio and/or video communications between multiple parties over a consolidated peer-to-peer media session. The peer-to-peer media session is consolidated in the sense that at least one of the two communications systems of the peer-to-peer media session performs media data relaying functions for at least one other communications system that is also a communications participant.", "patent_id": "9197701"}, {"patent_number": "9203954", "patent_date": "2015-12-01", "patent_num_combined_citations": "36", "patent_kind": "B1", "patent_title": "Enhanced caller-ID information selection and delivery", "patent_abstract": "Technologies relating to enhanced Caller ID information selection for a caller associated with a call and delivery of the selected enhanced Caller ID information to a callee associated with the call include one or more processors selecting, according to selection criteria, one or more enhanced Caller ID information items from a collection of available enhanced Caller ID information items pertaining to the caller that are stored across one or more databases of enhanced Caller ID information.", "patent_id": "9203954"}, {"patent_number": "9203965", "patent_date": "2015-12-01", "patent_num_combined_citations": "3", "patent_kind": "B1", "patent_title": "Method, device and system for providing notification of message", "patent_abstract": "System, method, and device are disclosed for providing a notification of a new message. According to certain embodiments, a device may receive a message via at least one communication interface; determine an attribute associated with the message based on contents of the message; determine a notification feature based, at least in part, on the attribute; and generate a notification according to the notification feature.", "patent_id": "9203965"}, {"patent_number": "9215317", "patent_date": "2015-12-15", "patent_num_combined_citations": "74", "patent_kind": "B2", "patent_title": "Unified caller identification across multiple communication modes", "patent_abstract": "A mobile device is adapted to operate in a first communication mode and a second communication mode. An identifier is acquired for a mobile device, wherein the identifier is sent to identify the mobile device when the mobile device places a call in the first communication mode. A call is placed to a destination device while the mobile device operates in the second communication mode. The same identifier is sent to the destination device while the mobile device operates in the second communication mode. The mobile device is served by a first service provider while it operates in the first communication mode. The mobile device is served by a second service provider while it operates in the second communication mode, the second service provider being different from the first service provider.", "patent_id": "9215317"}, {"patent_number": "9219772", "patent_date": "2015-12-22", "patent_num_combined_citations": "5", "patent_kind": "B2", "patent_title": "Persistent format conversions", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer-readable storage medium for persistent format conversions. One of the methods includes receiving an original communication to be routed from a first user to a second user, wherein the original communication is received in a first format; converting, based a format conversion rule, the original communication into a second, different format; routing the original communication to the recipient in the second format; receiving a response communication related to the original communication and to be routed from the second user to the first user; and based on determining that the response communication is responsive to the original communication, converting the response communication into the first format prior to routing the communication to the first user.", "patent_id": "9219772"}, {"patent_number": "9232190", "patent_date": "2016-01-05", "patent_num_combined_citations": "18", "patent_kind": "B1", "patent_title": "Systems and methods for managing multimedia conference calls", "patent_abstract": "Systems and methods are disclosed for managing a multimedia conference call. According to certain embodiments, a server establishes a multimedia conference call between a plurality of multimedia conference devices. The multimedia conference call includes the communication of multimedia conference contents via one or more of the plurality of multimedia conference devices. The server also records at least a portion of the multimedia conference contents; and detects one or more interrupting events. The interrupting events occur during the multimedia conference call. The server further provides substitute contents to the other multimedia conference devices of the plurality of multimedia conference devices. The substitute contents are generated based on a recorded portion of the multimedia conference call associated with a time to the interrupting events.", "patent_id": "9232190"}, {"patent_number": "9237235", "patent_date": "2016-01-12", "patent_num_combined_citations": "13", "patent_kind": "B2", "patent_title": "Call queuing for location-aware mobile devices", "patent_abstract": "A mobile device can be assigned to an extension configured as a Queue Agent (“QA”) in a call-queuing enabled virtual private branch exchange (vPBX). This and other mobile or fixed devices can be interconnected to form a virtual call center. Each extension can be assigned various rules, which specify how the incoming calls are answered at the extension and how calls in the call queue are selected for answering by the QA. As part of the rules, the vPBX system forwards calls from a call queue to the QA based on QA's availability status. If a location-aware mobile device is associated with the QA, the vPBX system can determine the QA's availability status based on a geographic location of the mobile device. A most geographically proximate agent can be selected for answering the call.", "patent_id": "9237235"}, {"patent_number": "9237307", "patent_date": "2016-01-12", "patent_num_combined_citations": "19", "patent_kind": "B1", "patent_title": "System and method for dynamically selecting networked cameras in a video conference", "patent_abstract": "Systems and methods are provided for dynamically selecting one or more networked cameras for providing real-time camera feeds to a video conference. The systems and methods may include identifying one or more networked cameras associated with an area of a conference participant. A server may analyze real-time camera feeds from the identified cameras, and select a video feed having a view of the participant. The server may provide the selected feed to the video conference via a conference bridge, and continue monitoring camera feeds of cameras associated with the participant's area for another camera feed having a better view of the participant. Networked cameras may include fixed and mobile cameras owned and operated by individuals that are not associated with the participant, but who have registered their cameras with the server for use in video conferences.", "patent_id": "9237307"}, {"patent_number": "9241073", "patent_date": "2016-01-19", "patent_num_combined_citations": "8", "patent_kind": "B1", "patent_title": "Systems and methods for managing an event scheduling request in a telephony system", "patent_abstract": "Systems and methods are disclosed for managing an event scheduling request in a telephony system. According to certain embodiments, a call between a first communication device and a second communication device is established. Upon authenticating a user identity associated with the second communication device, an event scheduling request is determined based on one or more attributes provided to the first communication device. A notification is provided to the second communication device based on the event scheduling request.", "patent_id": "9241073"}, {"patent_number": "9247050", "patent_date": "2016-01-26", "patent_num_combined_citations": "71", "patent_kind": "B2", "patent_title": "Telecommunications services activation", "patent_abstract": "Embodiments of the invention relate generally to computing devices and systems, as well as software, computer programs, applications, and interfaces, and more particularly, to systems, devices and methods to activate telecommunications services. For example, a method may include configuring configuration data for a user account, the configuration data specifying a subset of telecommunications services for one or more user accounts, presenting in an interface an identifier for accessing the subset of telecommunications services, receiving data representing a request to activate the subset of telecommunications services associated with the identifier, the data representing the request including a user identification number, and activating the user account to include the subset of the telecommunications services, wherein configuring the configuration data occurs prior to presenting the identifier.", "patent_id": "9247050"}, {"patent_number": "9264457", "patent_date": "2016-02-16", "patent_num_combined_citations": "11", "patent_kind": "B2", "patent_title": "Telephony application platform", "patent_abstract": "A hosted private branch exchange (PBX) platform includes associated application programming interfaces (APIs) that provide a range of integration points with the PBX platform that, in turn, enables the development of a broad range of applications that can customize and/or enhance the basic functionality of the underlying PBX platform.", "patent_id": "9264457"}, {"patent_number": "9264861", "patent_date": "2016-02-16", "patent_num_combined_citations": "9", "patent_kind": "B1", "patent_title": "Generating spatial models using crowdsourcing", "patent_abstract": "Contextual spatial models for indoor and outdoor structures are created from a plurality of devices using crowdsourcing. A method for creating a contextual spatial model for a premises includes receiving location information and contextual information from a plurality of devices. For each of the plurality of devices, the method receives location information of the device's location, and contextual information related to at least one of the device and a user associated with the device when the device is at the location. The method then determines a designation for each subject location within the premises by applying the received contextual information associated with the subject location to a location model (e.g., rules-based model or a machine learning model).", "patent_id": "9264861"}, {"patent_number": "9294985", "patent_date": "2016-03-22", "patent_num_combined_citations": "13", "patent_kind": "B2", "patent_title": "Bridge line appearance for location-aware mobile devices", "patent_abstract": "A vPBX server manages calls in a bridged line appearance (BLA) group. A BLA group can include extensions for location-aware mobile devices. The vPBX server contains location based forwarding rules that can be applied together with BLA redirection rules in managing incoming calls. A single extension can appear as a user interface element (e.g., an icon or button) on multiple mobile devices. Using the user interface element, a primary user can view a secondary user's status, including the secondary user's location information. The vPBX server allows the primary user to redirect the incoming calls to devices in accordance with the forwarding rules and the redirection rules.", "patent_id": "9294985"}, {"patent_number": "9306899", "patent_date": "2016-04-05", "patent_num_combined_citations": "20", "patent_kind": "B1", "patent_title": "System and method for determining presence based on an attribute of an electronic message", "patent_abstract": "Systems and methods are provided for determining a presence of an electronic message recipient based on an attribute of the electronic message, such as the content and/or context of the electronic message. The systems and methods can include acquiring, at a server, an electronic message from a sender, and determining an attribute of the electronic message. Based on the determined attribute, the server assigns an urgency level to the electronic message, which corresponds to a response time period. The server then monitors the recipient's device for a response to the electronic message, and to collect monitoring data about activity performed by the recipient on the device, or the environment surrounding the device. If the recipient does not respond within the response time period the server informs the sender a presence status of the recipient based on the monitoring data.", "patent_id": "9306899"}, {"patent_number": "9313328", "patent_date": "2016-04-12", "patent_num_combined_citations": "17", "patent_kind": "B2", "patent_title": "Active call processing and notifications", "patent_abstract": "Embodiments of the invention relate generally to computing devices and systems, as well as software, computer programs, applications, and user interfaces, and more particularly, to processing active calls and stored calls in a communication network for packetized and/or synchronous communications, and to generating notifications relating to active calls and stored calls. Other embodiments relate to creating and implementing bypass rules that allow a party to bypass a set of default prompts to a the party's communication device while enabling the caller device to access functions of a call processing system.", "patent_id": "9313328"}, {"patent_number": "9331977", "patent_date": "2016-05-03", "patent_num_combined_citations": "17", "patent_kind": "B2", "patent_title": "High availability for cloud-based services", "patent_abstract": "High availability mechanisms are described for cloud-based services such as voice-over-IP (VoIP) services.", "patent_id": "9331977"}, {"patent_number": "9332561", "patent_date": "2016-05-03", "patent_num_combined_citations": "6", "patent_kind": "B1", "patent_title": "Hybrid communications system using peer-to-peer and centralized architecture", "patent_abstract": "A hybrid communication system estimates a quality of service (QoS) for a plurality of session channels available to couple a first device on a first network with a second device on a second network. A first session channel is selected, from the plurality of session channels, that has a highest estimated QoS of all the plurality of session channels over a first time interval. The devices are instructed to establish a hybrid media session using the first session channel. During the hybrid media session the estimated QoS for the plurality of session channels is monitored. Responsive to the monitoring, a second session channel is selected, from the plurality of session channels, that has a highest estimated QoS of all the plurality of session channels over a second time interval. Responsive to the selecting, the devices are instructed establish the hybrid media session using the second session channel.", "patent_id": "9332561"}, {"patent_number": "9338067", "patent_date": "2016-05-10", "patent_num_combined_citations": "84", "patent_kind": "B2", "patent_title": "Network resource deployment for cloud-based services", "patent_abstract": "Techniques are described which simplify and/or automate many of the tasks associated with the configuration, deployment, and management of network resources to support cloud-based services.", "patent_id": "9338067"}, {"patent_number": "9350772", "patent_date": "2016-05-24", "patent_num_combined_citations": "25", "patent_kind": "B2", "patent_title": "Systems and methods for making common services available across network endpoints", "patent_abstract": "Systems and methods are disclosed for providing access to common services in a communication session. According to certain embodiments, a request to initiate a communication session is received. The communication can include a plurality of endpoints. An inventory of available services can be determined for each of the plurality of endpoints. At least one service that is commonly available to at least a subset of endpoints can be identified from the inventories of available services. Access can be provided to the at least one common service to the subset of endpoints during the communication session.", "patent_id": "9350772"}, {"patent_number": "9350845", "patent_date": "2016-05-24", "patent_num_combined_citations": "86", "patent_kind": "B2", "patent_title": "Universal call management platform", "patent_abstract": "Systems, methods and computer program products for enabling integration between various internet- or non-internet based communication services (e.g., as provided by different communications platforms and service providers) using a universal platform are described. In some implementations, a service manager is provided that can integrate call management capabilities with multiple communications platforms using the universal platform to enable seamless communication between the various platforms. For example, interactions between individual users on one or more platforms can be tracked in a single conversation history as a threaded interface. The universal platform can integrate with various platforms and third party protocols and services to provide call features that include, for example, call forwarding, call handling, multiple greeting prompts, call screening rules, ring-out rules, international calling, caller ID rules, after hours, and announcement prompts.", "patent_id": "9350845"}, {"patent_number": "9363365", "patent_date": "2016-06-07", "patent_num_combined_citations": "4", "patent_kind": "B1", "patent_title": "System and method for evaluating the quality of a communication session", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for evaluating the quality of a communication session or of a communication path used for the communication session. One of the methods includes initiating a communication session between a first communications device and a second communications device, wherein initiating the communication session comprises routing session data for the communication session along a first communication path between the first communications device and the second communications device; generating, at the first communications device, a plurality of reference content samples; generating a recording of the communication session as received at a first destination along the first communication path; and evaluating a quality of the communication session or of the first communication path by comparing the plurality of reference content samples with the recorded communication session.", "patent_id": "9363365"}, {"patent_number": "9369576", "patent_date": "2016-06-14", "patent_num_combined_citations": "42", "patent_kind": "B2", "patent_title": "Phone system with methodology for call parking", "patent_abstract": "A phone system with a methodology for call parking is described. According to one embodiment of the present invention, a user of a communications endpoint device can use a user interface at the communications endpoint device to select persons to notify of a parked call. Upon successfully parking the call, the phone system notifies the selected persons in the manner specified in their account profiles. Such manner can include sending an e-mail to the selected person or sending a text message to the selected person. Advantageously, the manner for notifying the selected persons of the parked call is determined by the selected persons themselves through configuration of their account profiles thereby alleviating the user parking the call from having to determine the manner for notifying the selected persons.", "patent_id": "9369576"}, {"patent_number": "9398085", "patent_date": "2016-07-19", "patent_num_combined_citations": "25", "patent_kind": "B2", "patent_title": "Systems and methods for initiating a peer-to-peer communication session", "patent_abstract": "Systems and methods are disclosed for initiating a peer-to-peer communication session. According to certain embodiments, at least one peer device is identified. A first request is sent to the at least one peer device for an inventory of service capabilities of the at least one peer device. The requested inventory of service capabilities of the at least one peer device is received from the at least one peer device. A second request is sent to the at least one peer device to initiate a communication session with the at least one peer device using at least one service from the requested inventory of service capabilities.", "patent_id": "9398085"}, {"patent_number": "9401993", "patent_date": "2016-07-26", "patent_num_combined_citations": "5", "patent_kind": "B1", "patent_title": "Automatic language selection for interactive voice response system", "patent_abstract": "An interactive voice response (IVR) system performs automatic language selection without requiring the caller to provide a manual language selection input. The IVR system receives an incoming call along with appropriate caller identification. The IVR system sends a request for the caller's language preference information either to the caller's device or to a service provider that hosts the caller's account. After receiving the caller's language preference information, the IVR system selects a language for the caller and provides an IVR menu tree using the selected language. The selected language is persisted as the caller's preferred language at either the IVR system or at a service provider for future use.", "patent_id": "9401993"}, {"patent_number": "9420013", "patent_date": "2016-08-16", "patent_num_combined_citations": "3", "patent_kind": "B1", "patent_title": "Method, device and system for providing historical communication content", "patent_abstract": "A communication server is disclosed. The communication server may receive, via at least one network interface, a request to add one or more new participants to a communication group; receive, from one or more members of the communication group, one or more selections indicating one or more selected portions of communication content for providing to the one or more new participants, wherein the communication content includes information transferred between a plurality of participants of the communication group prior to the one or more new participants being added to the communication group; determine, based on the one or more selections, a portion of the communication content for providing to the one or more new participants; and provide, via the at least one network interface, the portion of the communication content to one or more user devices associated with the one or more new participants.", "patent_id": "9420013"}, {"patent_number": "9455942", "patent_date": "2016-09-27", "patent_num_combined_citations": "4", "patent_kind": "B2", "patent_title": "Conversation timeline for heterogeneous messaging system", "patent_abstract": "A conversation timeline for a heterogeneous messaging system. In one embodiment, a method performed by one or more computing devices comprises: maintaining a conversation among users, the conversation comprising a plurality of messages between the users, each of the plurality of messages being a member of one of a plurality of predefined message classes, one of the plurality of messages being a member a different predefined message class of the plurality of predefined message classes than at least one other of the plurality of messages; causing display of a graphical representation of the conversation to one of the users; selecting a reply message class of the plurality of predefined message classes based on one or more reply control selection factors; and causing display, in association with display of the graphical representation of the conversation, reply message controls for adding a new message to the conversation in the reply message class.", "patent_id": "9455942"}, {"patent_number": "9456078", "patent_date": "2016-09-27", "patent_num_combined_citations": "38", "patent_kind": "B2", "patent_title": "Enhanced caller-ID information selection and delivery", "patent_abstract": "Technologies relating to enhanced Caller ID information selection for a caller associated with a call and delivery of the selected enhanced Caller ID information to a callee associated with the call include one or more processors selecting, according to selection criteria, one or more enhanced Caller ID information items from a collection of available enhanced Caller ID information items pertaining to the caller that are stored across one or more databases of enhanced Caller ID information.", "patent_id": "9456078"}, {"patent_number": "9473873", "patent_date": "2016-10-18", "patent_num_combined_citations": "36", "patent_kind": "B2", "patent_title": "Instant activation and provisioning for telecommunication services on a mobile device", "patent_abstract": "Methods and systems for instant activation of virtual PBX services on a mobile device are disclosed. In one aspect, a user request for activating virtual PBX services is received on a mobile device. An available primary identification number for the virtual PBX services is retrieved from a telecommunication service provider (TSP). A user interface is presented on the mobile device including a first interface portion presenting the available primary identification number and a second interface portion configured to receive a user identifier. Upon receiving the user input specifying the user identifier and while the user interface is still presented on the mobile device, a user instruction for activating the virtual PBX services is received. Upon receiving the user instruction, the user identifier is sent to the TSP. Then, a confirmation is received from the TSP.", "patent_id": "9473873"}, {"patent_number": "9503217", "patent_date": "2016-11-22", "patent_num_combined_citations": "13", "patent_kind": "B1", "patent_title": "System and method for releasing media streams from a communication server", "patent_abstract": "A first call leg is established between a first communication device and a communication server having a telephony controller for controlling a hardware media processor. A second call leg is established between a second communication device and the communication server. The first and second call legs carry a media stream between the first and second communication devices, and the media stream is initially intended for processing by the hardware media processor. A suitable condition is needed to transfer the media stream to a release server. When the suitable condition is not detected, the media stream is processed with the hardware media processor. When the suitable condition is detected, the media stream is transferred to the release server. The release server lacks a hardware media processor.", "patent_id": "9503217"}, {"patent_number": "9516170", "patent_date": "2016-12-06", "patent_num_combined_citations": "3", "patent_kind": "B2", "patent_title": "Method, device, and system for providing notification of message", "patent_abstract": "System, method, and device are disclosed for providing a notification of a new message. According to certain embodiments, a device may receive a message via at least one communication interface; determine an attribute associated with the message based on contents of the message; determine a notification feature based, at least in part, on the attribute; and generate a notification according to the notification feature.", "patent_id": "9516170"}, {"patent_number": "9521173", "patent_date": "2016-12-13", "patent_num_combined_citations": "7", "patent_kind": "B1", "patent_title": "System and method for managing calls", "patent_abstract": "A computer-implemented method for managing calls in a collaboration environment is provided. The method includes receiving, by a processor, a call into a collaboration session of the collaboration environment. The method also includes identifying, by the processor, a user from a plurality of users associated with the collaboration session, based on at least one of contextual information regarding the call and information regarding the plurality of users. The method further includes providing, by the processor, an interface on a device associated with the identified user, wherein the interface enables the identified user to instruct the device to handle the call within the collaboration session.", "patent_id": "9521173"}, {"patent_number": "9571641", "patent_date": "2017-02-14", "patent_num_combined_citations": "210", "patent_kind": "B2", "patent_title": "Techniques for bypassing call screening in a call messaging system", "patent_abstract": "A call messaging system includes a database comprising a call screening rule for a callee and a call screening engine configured to determine whether a bypass condition exists for an incoming call to the callee, and to bypass the call screening rule for the incoming call, if the bypass condition exists.", "patent_id": "9571641"}, {"patent_number": "9591138", "patent_date": "2017-03-07", "patent_num_combined_citations": "17", "patent_kind": "B2", "patent_title": "Call queuing for location-aware mobile devices", "patent_abstract": "A mobile device can be assigned to an extension configured as a Queue Agent (“QA”) in a call-queuing enabled virtual private branch exchange (vPBX). This and other mobile or fixed devices can be interconnected to form a virtual call center. Each extension can be assigned various rules, which specify how the incoming calls are answered at the extension and how calls in the call queue are selected for answering by the QA. As part of the rules, the vPBX system forwards calls from a call queue to the QA based on QA's availability status. If a location-aware mobile device is associated with the QA, the vPBX system can determine the QA's availability status based on a geographic location of the mobile device. A most geographically proximate agent can be selected for answering the call.", "patent_id": "9591138"}, {"patent_number": "9602986", "patent_date": "2017-03-21", "patent_num_combined_citations": "98", "patent_kind": "B2", "patent_title": "Universal call management platform", "patent_abstract": "Systems, methods and computer program products for enabling integration between various internet- or non-internet based communication services (e.g., as provided by different communications platforms and service providers) using a universal platform are described. In some implementations, a service manager is provided that can integrate call management capabilities with multiple communications platforms using the universal platform to enable seamless communication between the various platforms. For example, interactions between individual users on one or more platforms can be tracked in a single conversation history as a threaded interface. The universal platform can integrate with various platforms and third party protocols and services to provide call features that include, for example, call forwarding, call handling, multiple greeting prompts, call screening rules, ring-out rules, international calling, caller ID rules, after hours, and announcement prompts.", "patent_id": "9602986"}, {"patent_number": "9614795", "patent_date": "2017-04-04", "patent_num_combined_citations": "6", "patent_kind": "B2", "patent_title": "Persistent format conversions", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer-readable storage medium for persistent format conversions. One of the methods includes receiving an original communication to be routed from a first user to a second user, wherein the original communication is received in a first format; converting, based a format conversion rule, the original communication into a second, different format; routing the original communication to the recipient in the second format; receiving a response communication related to the original communication and to be routed from the second user to the first user; and based on determining that the response communication is responsive to the original communication, converting the response communication into the first format prior to routing the communication to the first user.", "patent_id": "9614795"}, {"patent_number": "9628621", "patent_date": "2017-04-18", "patent_num_combined_citations": "28", "patent_kind": "B2", "patent_title": "System and method for providing access to a visual phone menu", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for providing access to a visual phone menu is disclosed. One of the methods includes receiving a call request transmitted from a calling device to initiate a call to a recipient; saving state information associated with the caller's navigation through a voice response system; providing an option for the caller to select between receiving a visual phone menu (VPM) or continuing to listen to the voice response system menu; receiving a selection of the option to receive the VPM; providing the VPM to a client device including providing state information associated with the caller's navigation through the voice response system prior to the selection; and using the state information when the caller navigates back in the response tree using the VPM.", "patent_id": "9628621"}, {"patent_number": "9654631", "patent_date": "2017-05-16", "patent_num_combined_citations": "6", "patent_kind": "B2", "patent_title": "Automatic language selection for interactive voice response system", "patent_abstract": "An interactive voice response (IVR) system performs automatic language selection without requiring the caller to provide a manual language selection input. The IVR system receives an incoming call along with appropriate caller identification. The IVR system sends a request for the caller's language preference information either to the caller's device or to a service provider that hosts the caller's account. After receiving the caller's language preference information, the IVR system selects a language for the caller and provides an IVR menu tree using the selected language. The selected language is persisted as the caller's preferred language at either the IVR system or at a service provider for future use.", "patent_id": "9654631"}, {"patent_number": "9710142", "patent_date": "2017-07-18", "patent_num_combined_citations": "66", "patent_kind": "B1", "patent_title": "System and method for dynamic user interface gamification in conference calls", "patent_abstract": "A computer-implemented method for dynamically changing a conference graphical user interface is provided. The method includes providing a graphical user interface representative of a conference in an online environment to a plurality of participants in the conference, wherein the graphical user interface includes representations of the plurality of participants, and the representations are based on scores associated with the plurality of participants. The method further includes acquiring data from one or more of the plurality of participants representative of a participation level of a participant of the plurality of participants and updating the score associated with the participant using the acquired data. Moreover, the method includes determining changes to the graphical user interface based on a comparison of the scores associated with the plurality of participants and providing the changes to the graphical user interface to the plurality of participants.", "patent_id": "9710142"}, {"patent_number": "9716731", "patent_date": "2017-07-25", "patent_num_combined_citations": "6", "patent_kind": "B2", "patent_title": "Consolidated peer-to-peer media sessions for audio and/or video communications", "patent_abstract": "System, methods, and non-transitory computer-readable media storing computer-executable instructions for performing the methods are provided for facilitating electronic audio and/or video communications between multiple parties over a consolidated peer-to-peer media session. The peer-to-peer media session is consolidated in the sense that at least one of the two communications systems of the peer-to-peer media session performs media data relaying functions for at least one other communications system that is also a communications participant.", "patent_id": "9716731"}, {"patent_number": "9729827", "patent_date": "2017-08-08", "patent_num_combined_citations": "18", "patent_kind": "B2", "patent_title": "System and method for dynamically selecting networked cameras in a video conference", "patent_abstract": "Systems and methods are provided for dynamically selecting one or more networked cameras for providing real-time camera feeds to a video conference. The systems and methods may include identifying one or more networked cameras associated with an area of a conference participant. A server may analyze real-time camera feeds from the identified cameras, and select a video feed having a view of the participant. The server may provide the selected feed to the video conference via a conference bridge, and continue monitoring camera feeds of cameras associated with the participant's area for another camera feed having a better view of the participant. Networked cameras may include fixed and mobile cameras owned and operated by individuals that are not associated with the participant, but who have registered their cameras with the server for use in video conferences.", "patent_id": "9729827"}, {"patent_number": "9736176", "patent_date": "2017-08-15", "patent_num_combined_citations": "3", "patent_kind": "B2", "patent_title": "System and method for detecting security exposures of VOIP devices", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for detecting security exposures of Voice over Internet Protocol (VOIP) devices. One of the methods includes obtaining data identifying a source Internet Protocol (IP) address associated with a communication device that has been provisioned with configuration files for VOIP services; determining that a VOIP phone configuration interface is exposed over an untrusted network at the source IP address; and determining that the communication device associated with the source IP address has a security exposure based at least in part on determining that the VOIP phone configuration interface is exposed over the untrusted network at the source IP address.", "patent_id": "9736176"}, {"patent_number": "9736756", "patent_date": "2017-08-15", "patent_num_combined_citations": "245", "patent_kind": "B2", "patent_title": "Centralized status server for call management of location-aware mobile devices", "patent_abstract": "Systems, methods and computer program products for utilizing location information in a virtual private branch exchange (vPBX) system are described. In some implementations, the vPBX system can use the location information to determine an availability status of a user of a mobile device (e.g., out of the office, in the office, at home, busy, and the like). The vPBX system can obtain the geographic coordinates of the mobile device and correlate these coordinates with known coordinates for locations associated with the user (e.g., the user's office, home, or other predefined locations). An inference of the user's availability can then be determined based on the correlation (e.g., whether the user is currently out of the user's office, at the user's home, or at another location). The user's availability can be made available to other users associated with the vPBX system, and can be used for call management (e.g., routing).", "patent_id": "9736756"}, {"patent_number": "9742714", "patent_date": "2017-08-22", "patent_num_combined_citations": "3", "patent_kind": "B2", "patent_title": "Method, device and system for providing historical communication content", "patent_abstract": "A communication server is disclosed. The communication server may receive, via at least one network interface, a request to add one or more new participants to a communication group; receive, from one or more members of the communication group, one or more selections indicating one or more selected portions of communication content for providing to the one or more new participants, wherein the communication content includes information transferred between a plurality of participants of the communication group prior to the one or more new participants being added to the communication group; determine, based on the one or more selections, a portion of the communication content for providing to the one or more new participants; and provide, via the at least one network interface, the portion of the communication content to one or more user devices associated with the one or more new participants.", "patent_id": "9742714"}, {"patent_number": "9742909", "patent_date": "2017-08-22", "patent_num_combined_citations": "29", "patent_kind": "B2", "patent_title": "System and method for determining availability statuses for users", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for determining availability statuses for users of a communication service provider system. One of the methods includes obtaining data identifying a plurality of availability status features for a user of a communication service provider system and a respective weight for each of the availability status features; determining a respective current value of each of the availability status features; and determining an aggregate user availability status based at least in part on the current values of the availability status features and on the weights for the availability status features.", "patent_id": "9742909"}, {"patent_number": "9743439", "patent_date": "2017-08-22", "patent_num_combined_citations": "75", "patent_kind": "B2", "patent_title": "Mobile devices having a common communication mode", "patent_abstract": "A second communication mode can be enabled for a source device and a destination device. Each device can be a mobile device having a first communication mode and a default number for the first communication mode. The default numbers for the source device and the destination device can be stored. A call request can be received from the source device operating in the second communication mode. The call request can be directed to the default number of the destination device. The destination device can be determined as a client based on the default number of the destination device. A communication session can be established between the source device and the destination device over a network upon determining the destination device is an active client.", "patent_id": "9743439"}, {"patent_number": "9749386", "patent_date": "2017-08-29", "patent_num_combined_citations": "10", "patent_kind": "B1", "patent_title": "Behavior-driven service quality manager", "patent_abstract": "A method and system for improving communications is disclosed. For example, the method for improving communications includes using a user device having one or more sensors. Monitoring, using one or more of the sensors, for information reflecting a user-drive behavior associated with a communications session. Determining, using a triggering parameter analyzer, from the monitored information whether the user-driven indicator directs an improvement in a quality of service associated with the communications session. Transmitting to a communications system a request to improve the quality of service associated with the communications session based on the determination.", "patent_id": "9749386"}, {"patent_number": "9749457", "patent_date": "2017-08-29", "patent_num_combined_citations": "97", "patent_kind": "B2", "patent_title": "Provisioning interfaces for accessing virtual private branch exchange services through a mobile device", "patent_abstract": "Systems, methods and computer program products for facilitating the provisioning of a single and multi-line virtual private branch exchange (PBX) including automated call distribution via a mobile device are described. In some implementations, the provisioning of the single and multi-line virtual PBX can be achieved using one or more unique provisioning interfaces. The unique provisioning interfaces can enable the setup and configuration of a virtual PBX service account instantaneously from any geographical location at any time. Changes made to the virtual PBX service account can be immediately reflected back (e.g., in real-time) to the system providing the core operating environment.", "patent_id": "9749457"}, {"patent_number": "9755789", "patent_date": "2017-09-05", "patent_num_combined_citations": "14", "patent_kind": "B2", "patent_title": "Systems and methods for dynamic packet duplication in a network", "patent_abstract": "Systems and methods are provided for facilitating communication sessions between endpoints over one or more networks. In one implementation, a method includes receiving, by at least one processor, first data indicating that a communication session has been initiated to at least one endpoint. The method also includes receiving, by the at least one processor, second data corresponding to one or more application level metrics associated with the communication session and determining, by the at least one processor, during the communication session, based on the second data, a packet duplication model for transmitting one or more data packets over one or more networks.", "patent_id": "9755789"}, {"patent_number": "9769682", "patent_date": "2017-09-19", "patent_num_combined_citations": "7", "patent_kind": "B2", "patent_title": "System and method for evaluating the quality of a communication session", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer storage medium, for evaluating the quality of a communication session or of a communication path used for the communication session. One of the methods includes initiating a communication session between a first communications device and a second communications device, wherein initiating the communication session comprises routing session data for the communication session along a first communication path between the first communications device and the second communications device; generating, at the first communications device, a plurality of reference content samples; generating a recording of the communication session as received at a first destination along the first communication path; and evaluating a quality of the communication session or of the first communication path by comparing the plurality of reference content samples with the recorded communication session.", "patent_id": "9769682"}, {"patent_number": "9774722", "patent_date": "2017-09-26", "patent_num_combined_citations": "8", "patent_kind": "B2", "patent_title": "System and method for managing calls", "patent_abstract": "A computer-implemented method for managing calls in a collaboration environment is provided. The method includes receiving, by a processor, a call into a collaboration session of the collaboration environment. The method also includes identifying, by the processor, a user from a plurality of users associated with the collaboration session, based on at least one of contextual information regarding the call and information regarding the plurality of users. The method further includes providing, by the processor, an interface on a device associated with the identified user, wherein the interface enables the identified user to instruct the device to handle the call within the collaboration session.", "patent_id": "9774722"}, {"patent_number": "9774748", "patent_date": "2017-09-26", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "System and method for provisioning temporary telephone numbers", "patent_abstract": "Systems, methods, and computer program products for provisioning a temporary disposable number are described. A user can be provided with a pool of available temporary disposable numbers that have a limited shelf life. The user can select one of the available temporary disposable numbers while submitting a permanent phone number associated with a communications device (e.g., mobile phone, home phone, business phone, etc.). Prior to activating the selected temporary disposable number, the temporary disposable number is linked to the permanent phone number. After activation, when an incoming call to the temporary disposable number is received, the permanent phone number is identified to be associated with the temporary disposable number being called. The incoming call is then forwarded to the communications device on which the permanent phone number is established.", "patent_id": "9774748"}, {"patent_number": "9788168", "patent_date": "2017-10-10", "patent_num_combined_citations": "11", "patent_kind": "B2", "patent_title": "Generating spatial models using crowdsourcing", "patent_abstract": "Contextual spatial models for indoor and outdoor structures are created from a plurality of devices using crowdsourcing. A method for creating a contextual spatial model for a premises includes receiving location information and contextual information from a plurality of devices. For each of the plurality of devices, the method receives location information of the device's location, and contextual information related to at least one of the device and a user associated with the device when the device is at the location. The method then determines a designation for each subject location within the premises by applying the received contextual information associated with the subject location to a location model (e.g., rules-based model or a machine learning model).", "patent_id": "9788168"}, {"patent_number": "9813495", "patent_date": "2017-11-07", "patent_num_combined_citations": "39", "patent_kind": "B1", "patent_title": "Systems and methods for chat message notification", "patent_abstract": "Systems and methods are provided for facilitating a chat session. The systems and methods may include receiving chat data, and predicting a likelihood of interest of the user in the chat data, the prediction being based on a model of the user's behavior and information reflecting an attribute and an availability associated with a user. The systems and methods may further include providing a notification to a device associated with the user based on the determined likelihood of interest.", "patent_id": "9813495"}, {"patent_number": "9813560", "patent_date": "2017-11-07", "patent_num_combined_citations": "25", "patent_kind": "B2", "patent_title": "Systems and methods for managing multimedia conference calls", "patent_abstract": "Systems and methods are disclosed for managing a multimedia conference call. According to certain embodiments, a server establishes a multimedia conference call between a plurality of multimedia conference devices. The multimedia conference call includes the communication of multimedia conference contents via one or more of the plurality of multimedia conference devices. The server also records at least a portion of the multimedia conference contents; and detects one or more interrupting events. The interrupting events occur during the multimedia conference call. The server further provides substitute contents to the other multimedia conference devices of the plurality of multimedia conference devices. The substitute contents are generated based on a recorded portion of the multimedia conference call associated with a time to the interrupting events.", "patent_id": "9813560"}, {"patent_number": "9838441", "patent_date": "2017-12-05", "patent_num_combined_citations": "5", "patent_kind": "B2", "patent_title": "Hybrid communications system using peer-to-peer and centralized architecture", "patent_abstract": "A hybrid communication system estimates a quality of service (QoS) for a plurality of session channels available to couple a first device on a first network with a second device on a second network. A first session channel is selected, from the plurality of session channels, that has a highest estimated QoS of all the plurality of session channels over a first time interval. The devices are instructed to establish a hybrid media session using the first session channel. During the hybrid media session the estimated QoS for the plurality of session channels is monitored. Responsive to the monitoring, a second session channel is selected, from the plurality of session channels, that has a highest estimated QoS of all the plurality of session channels over a second time interval. Responsive to the selecting, the devices are instructed establish the hybrid media session using the second session channel.", "patent_id": "9838441"}, {"patent_number": "9843606", "patent_date": "2017-12-12", "patent_num_combined_citations": "4", "patent_kind": "B1", "patent_title": "Systems and methods for conferencing", "patent_abstract": "Systems and methods are provided for establishing a video conference session. The systems and methods may include receiving, from a first conference client device, a request to establish a conference session with a second conference client device; determining a first media router for forwarding, to the second conference client device, a media data stream with predetermined attributes of a plurality of first media data streams generated by the first conference client device; determining a second media router for forwarding, to the first conference client, a media data stream with predetermined media attributes of a plurality of second media data streams generated by the second conference client device; and transmitting, to the first conference client device, a first address associated with the first media router and a second address associated with the second media router.", "patent_id": "9843606"}, {"patent_number": "9854090", "patent_date": "2017-12-26", "patent_num_combined_citations": "7", "patent_kind": "B2", "patent_title": "Managing phone numbers in a telephony system", "patent_abstract": "Techniques are described for managing phone numbers associated with a telephony system to reduce the likelihood that calls or transmissions directed to a subscriber or endpoint to which a phone number was previously assigned are received by a new subscriber or endpoint to which that number is reassigned.", "patent_id": "9854090"}, {"patent_number": "9871926", "patent_date": "2018-01-16", "patent_num_combined_citations": "24", "patent_kind": "B2", "patent_title": "Call queuing for location-aware mobile devices", "patent_abstract": "A mobile device can be assigned to an extension configured as a Queue Agent (“QA”) in a call-queuing enabled virtual private branch exchange (vPBX). This and other mobile or fixed devices can be interconnected to form a virtual call center. Each extension can be assigned various rules, which specify how the incoming calls are answered at the extension and how calls in the call queue are selected for answering by the QA. As part of the rules, the vPBX system forwards calls from a call queue to the QA based on QA's availability status. If a location-aware mobile device is associated with the QA, the vPBX system can determine the QA's availability status based on a geographic location of the mobile device. A most geographically proximate agent can be selected for answering the call.", "patent_id": "9871926"}, {"patent_number": "9882953", "patent_date": "2018-01-30", "patent_num_combined_citations": "4", "patent_kind": "B2", "patent_title": "Systems and methods for managing network services based on real-time and historical data", "patent_abstract": "Systems and methods are provided for facilitating media communication sessions along a path established between endpoints over one or more networks, wherein each media communication session includes a transmission of one or more media data packets over the one or more networks. The systems and methods may include receiving a request from a first endpoint to initiate a media communication session. A system may, responsive to receiving the request, determine a configuration for the media communication session from among a set of potential configurations. The determined configuration may include a path involving one or more network elements configured to process and to transmit the media data packets, and the determination can be based on (i) a historical measurement and a real-time measurement of one or more parameters contributing to an expected quality of media communication, and (ii) a target quality of media communication.", "patent_id": "9882953"}, {"patent_number": "9888125", "patent_date": "2018-02-06", "patent_num_combined_citations": "12", "patent_kind": "B2", "patent_title": "Systems and methods for managing an event scheduling request in a telephony system", "patent_abstract": "Systems and methods are disclosed for managing an event scheduling request in a telephony system. According to certain embodiments, a call between a first communication device and a second communication device is established. Upon authenticating a user identity associated with the second communication device, an event scheduling request is determined based on one or more attributes provided to the first communication device. A notification is provided to the second communication device based on the event scheduling request.", "patent_id": "9888125"}, {"patent_number": "9906471", "patent_date": "2018-02-27", "patent_num_combined_citations": "7", "patent_kind": "B1", "patent_title": "System, device, and method for managing composition of electronic messages using temporary suspensions", "patent_abstract": "A communications device for managing composition of electronic messages using temporary suspensions is disclosed. The communications device includes a network interface, a memory, and a processor in communication with the network interface and the memory. The processor is configured to receive a request to suspend composition of a first electronic message in an input field associated with an electronic message exchange between two or more participants, store in the memory the first electronic message, and clear the input field for composition of a second electronic message. Responsive to a trigger indicating resumption of composition of the first electronic message, the processor is further configured to insert the first electronic message in the input field, thereby enabling completion of the composition of the first electronic message, and to add the first electronic message to a thread of the electronic message exchange. The first electronic message is displayed in the thread of the electronic message exchange chronologically after the second electronic message.", "patent_id": "9906471"}, {"patent_number": "9906629", "patent_date": "2018-02-27", "patent_num_combined_citations": "8", "patent_kind": "B2", "patent_title": "Persistent format conversions", "patent_abstract": "Methods, systems, and apparatus, including computer programs encoded on a computer-readable storage medium for persistent format conversions. One of the methods includes receiving an original communication to be routed from a first user to a second user, wherein the original communication is received in a first format; converting, based a format conversion rule, the original communication into a second, different format; routing the original communication to the recipient in the second format; receiving a response communication related to the original communication and to be routed from the second user to the first user; and based on determining that the response communication is responsive to the original communication, converting the response communication into the first format prior to routing the communication to the first user.", "patent_id": "9906629"}, {"patent_number": "9930473", "patent_date": "2018-03-27", "patent_num_combined_citations": "37", "patent_kind": "B2", "patent_title": "Instant activation and provisioning for telecommunication services on a mobile device", "patent_abstract": "Methods and systems for instant activation of virtual PBX services on a mobile device are disclosed. In one aspect, a user request for activating virtual PBX services is received on a mobile device. An available primary identification number for the virtual PBX services is retrieved from a telecommunication service provider (TSP). A user interface is presented on the mobile device including a first interface portion presenting the available primary identification number and a second interface portion configured to receive a user identifier. Upon receiving the user input specifying the user identifier and while the user interface is still presented on the mobile device, a user instruction for activating the virtual PBX services is received. Upon receiving the user instruction, the user identifier is sent to the TSP. Then, a confirmation is received from the TSP.", "patent_id": "9930473"}, {"patent_number": "9936268", "patent_date": "2018-04-03", "patent_num_combined_citations": "13", "patent_kind": "B2", "patent_title": "User partitioning in a communication system", "patent_abstract": "Systems and methods for routing an incoming service request to one of a plurality of pod units are described. A communication system can be provided that includes a plurality of pods each having a first pod serving a first subset of user accounts associated with a hosted PBX system. The first pod can include a first pod unit in a first data center and a second pod unit in a second data center. A global user directory (GUD) can be used to store a plurality of user keys that are mapped to the plurality of pods. A router can be provided to identify a user key from an incoming service request, query the GUD to identify the first pod as being associated with the user key, and route the incoming service request to one of the first and second pod units.", "patent_id": "9936268"}, {"patent_number": "9936434", "patent_date": "2018-04-03", "patent_num_combined_citations": "10", "patent_kind": "B2", "patent_title": "Method and phone system for pre-call quality of service assessment of available networks", "patent_abstract": "A method for providing communication in a communication device is disclosed. The method may include receiving a control instruction for a call session via the communication device, and assessing a quality of service of at least one of a default Wi-Fi network and a radio network. The method may also include selectively recommending to a user of the communication device the radio network for the call session based on the quality of service, and initiating the call session using the default Wi-Fi network or the radio network based on a selection made by the user.", "patent_id": "9936434"}, {"patent_number": "9948775", "patent_date": "2018-04-17", "patent_num_combined_citations": "211", "patent_kind": "B2", "patent_title": "Techniquest for bypassing call screening in a call messaging system", "patent_abstract": "A call messaging system includes a database comprising a call screening rule for a callee and a call screening engine configured to determine whether a bypass condition exists for an incoming call to the callee, and to bypass the call screening rule for the incoming call, if the bypass condition exists.", "patent_id": "9948775"}, {"patent_number": "9961193", "patent_date": "2018-05-01", "patent_num_combined_citations": "51", "patent_kind": "B2", "patent_title": "Enhanced caller-ID information selection and delivery", "patent_abstract": "Technologies relating to enhanced Caller ID information selection for a caller associated with a call and delivery of the selected enhanced Caller ID information to a callee associated with the call include one or more processors selecting, according to selection criteria, one or more enhanced Caller ID information items from a collection of available enhanced Caller ID information items pertaining to the caller that are stored across one or more databases of enhanced Caller ID information.", "patent_id": "9961193"}, {"patent_number": "9967520", "patent_date": "2018-05-08", "patent_num_combined_citations": "17", "patent_kind": "B1", "patent_title": "Method and system for enhanced conference management", "patent_abstract": "The present disclosure provides methods and systems for enhanced conference management. According to some embodiments, a conference management server for enhanced conference management is provided. The conference management server comprises a memory storing a set of instructions, and at least one processor configured to execute the instructions to: receive, from a user device, conference information including a conference subject and an identification of at least one participant; determine, based on the received conference information, a degree of formality for a conference; and send a conference notification to one or more devices or participants identified based on the conference information, the conference notification including information reflecting the degree of formality for the conference.", "patent_id": "9967520"}, {"patent_number": "D660865", "patent_date": "2012-05-29", "patent_num_combined_citations": "13", "patent_kind": "S1", "patent_title": "Display screen with graphical user interface", "patent_abstract": null, "patent_id": "D660865"}, {"patent_number": "D758394", "patent_date": "2016-06-07", "patent_num_combined_citations": "13", "patent_kind": "S1", "patent_title": "Display screen with a graphical user interface", "patent_abstract": null, "patent_id": "D758394"}], "inventors": [{"inventor_first_name": "Vlad", "inventor_location_id": "37.5088|-122.203", "inventor_key_id": "3183686"}, {"inventor_first_name": "Nisha K.", "inventor_location_id": "37.7292|-123.047", "inventor_key_id": "2228497"}, {"inventor_first_name": "Naveen", "inventor_location_id": "37.3688|-122.036", "inventor_key_id": "2248070"}, {"inventor_first_name": "Rituparna", "inventor_location_id": "37.4139|-122.085", "inventor_key_id": "2585531"}, {"inventor_first_name": "Vi", "inventor_location_id": "37.7292|-123.047", "inventor_key_id": "3152155"}, {"inventor_first_name": "Christopher", "inventor_location_id": "37.5698|-122.226", "inventor_key_id": "608692"}, {"inventor_first_name": "Dmitriy", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "785293"}, {"inventor_first_name": "Vlad", "inventor_location_id": "37.5301|-122.255", "inventor_key_id": "3183686"}, {"inventor_first_name": "Vlad", "inventor_location_id": "39.5504|-119.803", "inventor_key_id": "3183686"}, {"inventor_first_name": "Curt T.", "inventor_location_id": "37.7292|-123.047", "inventor_key_id": "539851"}, {"inventor_first_name": "Natasha", "inventor_location_id": "37.4982|-122.26", "inventor_key_id": "2274530"}, {"inventor_first_name": "Patrice", "inventor_location_id": "37.7292|-123.047", "inventor_key_id": "2378546"}, {"inventor_first_name": "Anton", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "268174"}, {"inventor_first_name": "Naveen", "inventor_location_id": "37.2664|-122.026", "inventor_key_id": "2285930"}, {"inventor_first_name": "Martin", "inventor_location_id": "37.5088|-122.203", "inventor_key_id": "1940732"}, {"inventor_first_name": "Theodore", "inventor_location_id": "37.5557|-122.358", "inventor_key_id": "3004079"}, {"inventor_first_name": "Aleksei", "inventor_location_id": "37.5088|-122.203", "inventor_key_id": "279482"}, {"inventor_first_name": "Aleksei Dmitrievich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "306350"}, {"inventor_first_name": "Alexey Nicolaevich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "309919"}, {"inventor_first_name": "Dmitry Sergeevich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "761011"}, {"inventor_first_name": "Santosh", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "2847775"}, {"inventor_first_name": "Brian David", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "450854"}, {"inventor_first_name": "Ian", "inventor_location_id": "39.6021|-104.919", "inventor_key_id": "1273078"}, {"inventor_first_name": "Wanning", "inventor_location_id": "37.5841|-122.366", "inventor_key_id": "3199475"}, {"inventor_first_name": "Dmitry Sergeevich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "654052"}, {"inventor_first_name": "Ilya Vladimirovich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "1286048"}, {"inventor_first_name": "Aleksei Nikolaevich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "182866"}, {"inventor_first_name": "Alexey Petrovich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "343493"}, {"inventor_first_name": "Ivan Gennadevich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "1267506"}, {"inventor_first_name": "Alexey Konstantinovich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "285187"}, {"inventor_first_name": "Ivan Viktorovich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "1287116"}, {"inventor_first_name": "Santosh Panattu", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "2878303"}, {"inventor_first_name": "Xiaoming", "inventor_location_id": "37.3094|-122.061", "inventor_key_id": "3281276"}, {"inventor_first_name": "Helen", "inventor_location_id": "37.5698|-122.226", "inventor_key_id": "1215087"}, {"inventor_first_name": "Igor", "inventor_location_id": "37.7292|-123.047", "inventor_key_id": "1291851"}, {"inventor_first_name": "Kira", "inventor_location_id": "37.5557|-122.358", "inventor_key_id": "1743824"}, {"inventor_first_name": "Yuri", "inventor_location_id": "37.371|-121.96", "inventor_key_id": "3294280"}, {"inventor_first_name": "Dmitriy", "inventor_location_id": null, "inventor_key_id": "785293"}, {"inventor_first_name": "Dmitry Yakovlevich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "758488"}, {"inventor_first_name": "Alexander Alekseevich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "275296"}, {"inventor_first_name": "Jim", "inventor_location_id": "37.5088|-122.203", "inventor_key_id": "1378347"}, {"inventor_first_name": "Ehtesham", "inventor_location_id": "37.7581|-121.96", "inventor_key_id": "858524"}, {"inventor_first_name": "Santosh", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "2847774"}, {"inventor_first_name": "Jurgen", "inventor_location_id": "48.168|11.8041", "inventor_key_id": "1608617"}, {"inventor_first_name": "Karl", "inventor_location_id": "47.79|11.8335", "inventor_key_id": "1725308"}, {"inventor_first_name": "Thomas", "inventor_location_id": "48.0019|11.1817", "inventor_key_id": "3028910"}, {"inventor_first_name": "Antonios", "inventor_location_id": "37.9664|23.6182", "inventor_key_id": "137582"}, {"inventor_first_name": "Patrick", "inventor_location_id": "48.1546|11.5258", "inventor_key_id": "2379451"}, {"inventor_first_name": "Karl", "inventor_location_id": "48.1546|11.5258", "inventor_key_id": "1724879"}, {"inventor_first_name": "Michael", "inventor_location_id": "48.0871|10.8605", "inventor_key_id": "2193423"}, {"inventor_first_name": "Bernhard", "inventor_location_id": "47.9082|11.8559", "inventor_key_id": "345168"}, {"inventor_first_name": "Norbert", "inventor_location_id": "48.5513|12.2004", "inventor_key_id": "2276541"}, {"inventor_first_name": "Peter", "inventor_location_id": "48.1546|11.5258", "inventor_key_id": "2328138"}, {"inventor_first_name": "Bizhan", "inventor_location_id": "26.3738|-80.1051", "inventor_key_id": "393198"}, {"inventor_first_name": "Farrokh Mohammadzadeh", "inventor_location_id": "26.3738|-80.1051", "inventor_key_id": "941039"}, {"inventor_first_name": "Schah Walli", "inventor_location_id": "26.3738|-80.1051", "inventor_key_id": "2675646"}, {"inventor_first_name": "John Jianshi", "inventor_location_id": "37.5202|-122.276", "inventor_key_id": "1623721"}, {"inventor_first_name": "Nishit", "inventor_location_id": "37.5698|-122.226", "inventor_key_id": "2282763"}, {"inventor_first_name": "Vlad", "inventor_location_id": "37.5202|-122.276", "inventor_key_id": "3183686"}, {"inventor_first_name": "Christopher", "inventor_location_id": "45.5426|-122.62", "inventor_key_id": "608692"}, {"inventor_first_name": "Andrew Mark", "inventor_location_id": "52.914|-1.24025", "inventor_key_id": "215704"}, {"inventor_first_name": "Ralf", "inventor_location_id": "51.6143|7.52281", "inventor_key_id": "2589561"}, {"inventor_first_name": "Guohua", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "1100429"}, {"inventor_first_name": "Hongjin", "inventor_location_id": "26.9883|119.548", "inventor_key_id": "1184931"}, {"inventor_first_name": "Jinku", "inventor_location_id": "24.4587|118.075", "inventor_key_id": "1410763"}, {"inventor_first_name": "Vlad", "inventor_location_id": "37.5557|-122.358", "inventor_key_id": "3178814"}, {"inventor_first_name": "Bruce", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "452553"}, {"inventor_first_name": "Vladimir", "inventor_location_id": "37.5557|-122.358", "inventor_key_id": "3178815"}, {"inventor_first_name": "Boris", "inventor_location_id": "37.3688|-122.036", "inventor_key_id": "371233"}, {"inventor_first_name": "Praful", "inventor_location_id": "37.3682|-122.146", "inventor_key_id": "2420022"}, {"inventor_first_name": "Natalie", "inventor_location_id": "37.4982|-122.26", "inventor_key_id": "2274529"}, {"inventor_first_name": "Vladimir", "inventor_location_id": "38.9293|-119.988", "inventor_key_id": "3178815"}, {"inventor_first_name": "Vladimir", "inventor_location_id": "37.5841|-122.366", "inventor_key_id": "3178815"}, {"inventor_first_name": "Igor", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "1291692"}, {"inventor_first_name": "Yakov", "inventor_location_id": "37.6531|-122.344", "inventor_key_id": "3350506"}, {"inventor_first_name": "Jian", "inventor_location_id": "37.7217|-121.89", "inventor_key_id": "1484118"}, {"inventor_first_name": "John", "inventor_location_id": "37.5994|-122.04", "inventor_key_id": "1351169"}, {"inventor_first_name": "Michael", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "2000355"}, {"inventor_first_name": "Vlad", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "3183686"}, {"inventor_first_name": "Bruce", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "452553"}, {"inventor_first_name": "Vladimir", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "3178815"}, {"inventor_first_name": "Vadim", "inventor_location_id": "37.5698|-122.226", "inventor_key_id": "3185999"}, {"inventor_first_name": "Christopher", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "608692"}, {"inventor_first_name": "Dieter W.", "inventor_location_id": "37.4636|-122.429", "inventor_key_id": "766409"}, {"inventor_first_name": "Colin D.", "inventor_location_id": "34.7203|-120.064", "inventor_key_id": "531221"}, {"inventor_first_name": "David S.", "inventor_location_id": "34.7203|-120.064", "inventor_key_id": "796814"}, {"inventor_first_name": "Leland W.", "inventor_location_id": "34.7203|-120.064", "inventor_key_id": "1880603"}, {"inventor_first_name": "Robert F.", "inventor_location_id": "34.7203|-120.064", "inventor_key_id": "2633848"}, {"inventor_first_name": "Andrey", "inventor_location_id": "64.543|40.5371", "inventor_key_id": "155512"}, {"inventor_first_name": "James", "inventor_location_id": "37.5308|-121.942", "inventor_key_id": "1570001"}, {"inventor_first_name": "Michael G.", "inventor_location_id": "37.371|-121.96", "inventor_key_id": "2086862"}, {"inventor_first_name": "Chris", "inventor_location_id": "37.5698|-122.226", "inventor_key_id": "608691"}, {"inventor_first_name": "Vlad", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "3178814"}, {"inventor_first_name": "Christopher", "inventor_location_id": "37.7292|-123.047", "inventor_key_id": "608692"}, {"inventor_first_name": "Santosh", "inventor_location_id": "37.3781|-122.339", "inventor_key_id": "2847775"}, {"inventor_first_name": "Xiaoqiang", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "3285753"}, {"inventor_first_name": "Mikhail", "inventor_location_id": "37.6945|-122.086", "inventor_key_id": "2116256"}, {"inventor_first_name": "Chris", "inventor_location_id": "37.5202|-122.276", "inventor_key_id": "608691"}, {"inventor_first_name": "Patrice", "inventor_location_id": "37.5202|-122.276", "inventor_key_id": "2378546"}, {"inventor_first_name": "Igor", "inventor_location_id": "37.2969|-121.831", "inventor_key_id": "1291851"}, {"inventor_first_name": "Benjamin", "inventor_location_id": "37.4613|-122.198", "inventor_key_id": "3505982"}, {"inventor_first_name": "Vlad", "inventor_location_id": "38.9293|-119.988", "inventor_key_id": "3178814"}, {"inventor_first_name": "Alexey Dmitrievich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "319054"}, {"inventor_first_name": "Evgeniya Ivanovna", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "820191"}, {"inventor_first_name": "Niels Holgerovich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "2278719"}, {"inventor_first_name": "Natalia Sergeevna", "inventor_location_id": "59.126|37.9105", "inventor_key_id": "2280064"}, {"inventor_first_name": "Pavel Aleksandrovich", "inventor_location_id": "59.9179|30.3806", "inventor_key_id": "2326640"}, {"inventor_first_name": "Christopher Van", "inventor_location_id": "37.5698|-122.226", "inventor_key_id": "580618"}, {"inventor_first_name": "Tetsumasa", "inventor_location_id": "37.7292|-123.047", "inventor_key_id": "3133100"}, {"inventor_first_name": "Svetlana", "inventor_location_id": "37.7292|-123.047", "inventor_key_id": "106980"}, {"inventor_first_name": "Craig Douglas", "inventor_location_id": "37.4757|-122.103", "inventor_key_id": "613973"}]}], "count": 1, "total_assignee_count": 1}